Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/spw.h
/**
 * \brief Component description for SPW
 *
 * Copyright (c) 2020 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2020-01-08T10:06:16Z */
#ifndef _SAMRH71_SPW_COMPONENT_H_
#define _SAMRH71_SPW_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SPW                                          */
/* ************************************************************************** */

/* -------- SPW_ROUTER_STS : (SPW Offset: 0x00) ( R/ 32) SpW Router Status -------- */
#define SPW_ROUTER_STS_DEST_Pos               _U_(0)                                               /**< (SPW_ROUTER_STS) Destination addr Position */
#define SPW_ROUTER_STS_DEST_Msk               (_U_(0x1F) << SPW_ROUTER_STS_DEST_Pos)               /**< (SPW_ROUTER_STS) Destination addr Mask */
#define SPW_ROUTER_STS_DEST(value)            (SPW_ROUTER_STS_DEST_Msk & ((value) << SPW_ROUTER_STS_DEST_Pos))
#define SPW_ROUTER_STS_SOURCE_Pos             _U_(8)                                               /**< (SPW_ROUTER_STS) Source address Position */
#define SPW_ROUTER_STS_SOURCE_Msk             (_U_(0x1F) << SPW_ROUTER_STS_SOURCE_Pos)             /**< (SPW_ROUTER_STS) Source address Mask */
#define SPW_ROUTER_STS_SOURCE(value)          (SPW_ROUTER_STS_SOURCE_Msk & ((value) << SPW_ROUTER_STS_SOURCE_Pos))
#define SPW_ROUTER_STS_BYTE_Pos               _U_(16)                                              /**< (SPW_ROUTER_STS) Router byte Position */
#define SPW_ROUTER_STS_BYTE_Msk               (_U_(0xFF) << SPW_ROUTER_STS_BYTE_Pos)               /**< (SPW_ROUTER_STS) Router byte Mask */
#define SPW_ROUTER_STS_BYTE(value)            (SPW_ROUTER_STS_BYTE_Msk & ((value) << SPW_ROUTER_STS_BYTE_Pos))
#define SPW_ROUTER_STS_COUNT_Pos              _U_(24)                                              /**< (SPW_ROUTER_STS) Packet Count Position */
#define SPW_ROUTER_STS_COUNT_Msk              (_U_(0xFF) << SPW_ROUTER_STS_COUNT_Pos)              /**< (SPW_ROUTER_STS) Packet Count Mask */
#define SPW_ROUTER_STS_COUNT(value)           (SPW_ROUTER_STS_COUNT_Msk & ((value) << SPW_ROUTER_STS_COUNT_Pos))
#define SPW_ROUTER_STS_Msk                    _U_(0xFFFF1F1F)                                      /**< (SPW_ROUTER_STS) Register Mask  */


/* -------- SPW_ROUTER_CFG : (SPW Offset: 0x04) (R/W 32) SpW Router Config -------- */
#define SPW_ROUTER_CFG_LAENA_Pos              _U_(0)                                               /**< (SPW_ROUTER_CFG) LA Routing Enable Position */
#define SPW_ROUTER_CFG_LAENA_Msk              (_U_(0x1) << SPW_ROUTER_CFG_LAENA_Pos)               /**< (SPW_ROUTER_CFG) LA Routing Enable Mask */
#define SPW_ROUTER_CFG_LAENA(value)           (SPW_ROUTER_CFG_LAENA_Msk & ((value) << SPW_ROUTER_CFG_LAENA_Pos))
#define SPW_ROUTER_CFG_FALLBACK_Pos           _U_(1)                                               /**< (SPW_ROUTER_CFG) Fallback Routing Position */
#define SPW_ROUTER_CFG_FALLBACK_Msk           (_U_(0x1) << SPW_ROUTER_CFG_FALLBACK_Pos)            /**< (SPW_ROUTER_CFG) Fallback Routing Mask */
#define SPW_ROUTER_CFG_FALLBACK(value)        (SPW_ROUTER_CFG_FALLBACK_Msk & ((value) << SPW_ROUTER_CFG_FALLBACK_Pos))
#define SPW_ROUTER_CFG_DISTIMEOUT_Pos         _U_(2)                                               /**< (SPW_ROUTER_CFG) Disable Timeout Position */
#define SPW_ROUTER_CFG_DISTIMEOUT_Msk         (_U_(0x1) << SPW_ROUTER_CFG_DISTIMEOUT_Pos)          /**< (SPW_ROUTER_CFG) Disable Timeout Mask */
#define SPW_ROUTER_CFG_DISTIMEOUT(value)      (SPW_ROUTER_CFG_DISTIMEOUT_Msk & ((value) << SPW_ROUTER_CFG_DISTIMEOUT_Pos))
#define SPW_ROUTER_CFG_Msk                    _U_(0x00000007)                                      /**< (SPW_ROUTER_CFG) Register Mask  */


/* -------- SPW_ROUTER_TIMEOUT : (SPW Offset: 0x08) ( R/ 32) SpW Router Timeout -------- */
#define SPW_ROUTER_TIMEOUT_ADDR_Pos           _U_(0)                                               /**< (SPW_ROUTER_TIMEOUT) Physical Address Position */
#define SPW_ROUTER_TIMEOUT_ADDR_Msk           (_U_(0x1F) << SPW_ROUTER_TIMEOUT_ADDR_Pos)           /**< (SPW_ROUTER_TIMEOUT) Physical Address Mask */
#define SPW_ROUTER_TIMEOUT_ADDR(value)        (SPW_ROUTER_TIMEOUT_ADDR_Msk & ((value) << SPW_ROUTER_TIMEOUT_ADDR_Pos))
#define SPW_ROUTER_TIMEOUT_LOCKED_Pos         _U_(31)                                              /**< (SPW_ROUTER_TIMEOUT) Locked Position */
#define SPW_ROUTER_TIMEOUT_LOCKED_Msk         (_U_(0x1) << SPW_ROUTER_TIMEOUT_LOCKED_Pos)          /**< (SPW_ROUTER_TIMEOUT) Locked Mask */
#define SPW_ROUTER_TIMEOUT_LOCKED(value)      (SPW_ROUTER_TIMEOUT_LOCKED_Msk & ((value) << SPW_ROUTER_TIMEOUT_LOCKED_Pos))
#define SPW_ROUTER_TIMEOUT_Msk                _U_(0x8000001F)                                      /**< (SPW_ROUTER_TIMEOUT) Register Mask  */


/* -------- SPW_ROUTER_TABLE : (SPW Offset: 0x80) (R/W 32) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) -------- */
#define SPW_ROUTER_TABLE_ADDR_Pos             _U_(0)                                               /**< (SPW_ROUTER_TABLE) Address Position */
#define SPW_ROUTER_TABLE_ADDR_Msk             (_U_(0x1F) << SPW_ROUTER_TABLE_ADDR_Pos)             /**< (SPW_ROUTER_TABLE) Address Mask */
#define SPW_ROUTER_TABLE_ADDR(value)          (SPW_ROUTER_TABLE_ADDR_Msk & ((value) << SPW_ROUTER_TABLE_ADDR_Pos))
#define SPW_ROUTER_TABLE_DELHEAD_Pos          _U_(8)                                               /**< (SPW_ROUTER_TABLE) Delete Header Byte Position */
#define SPW_ROUTER_TABLE_DELHEAD_Msk          (_U_(0x1) << SPW_ROUTER_TABLE_DELHEAD_Pos)           /**< (SPW_ROUTER_TABLE) Delete Header Byte Mask */
#define SPW_ROUTER_TABLE_DELHEAD(value)       (SPW_ROUTER_TABLE_DELHEAD_Msk & ((value) << SPW_ROUTER_TABLE_DELHEAD_Pos))
#define SPW_ROUTER_TABLE_Msk                  _U_(0x0000011F)                                      /**< (SPW_ROUTER_TABLE) Register Mask  */


/* -------- SPW_LINK1_PI_RM : (SPW Offset: 0x400) ( R/ 32) SpW Link 1 Pending Read Masked Interrupt -------- */
#define SPW_LINK1_PI_RM_DISERR_Pos            _U_(0)                                               /**< (SPW_LINK1_PI_RM) DisErr Position */
#define SPW_LINK1_PI_RM_DISERR_Msk            (_U_(0x1) << SPW_LINK1_PI_RM_DISERR_Pos)             /**< (SPW_LINK1_PI_RM) DisErr Mask */
#define SPW_LINK1_PI_RM_DISERR(value)         (SPW_LINK1_PI_RM_DISERR_Msk & ((value) << SPW_LINK1_PI_RM_DISERR_Pos))
#define SPW_LINK1_PI_RM_PARERR_Pos            _U_(1)                                               /**< (SPW_LINK1_PI_RM) ParErr Position */
#define SPW_LINK1_PI_RM_PARERR_Msk            (_U_(0x1) << SPW_LINK1_PI_RM_PARERR_Pos)             /**< (SPW_LINK1_PI_RM) ParErr Mask */
#define SPW_LINK1_PI_RM_PARERR(value)         (SPW_LINK1_PI_RM_PARERR_Msk & ((value) << SPW_LINK1_PI_RM_PARERR_Pos))
#define SPW_LINK1_PI_RM_ESCERR_Pos            _U_(2)                                               /**< (SPW_LINK1_PI_RM) ESCErr Position */
#define SPW_LINK1_PI_RM_ESCERR_Msk            (_U_(0x1) << SPW_LINK1_PI_RM_ESCERR_Pos)             /**< (SPW_LINK1_PI_RM) ESCErr Mask */
#define SPW_LINK1_PI_RM_ESCERR(value)         (SPW_LINK1_PI_RM_ESCERR_Msk & ((value) << SPW_LINK1_PI_RM_ESCERR_Pos))
#define SPW_LINK1_PI_RM_CRERR_Pos             _U_(3)                                               /**< (SPW_LINK1_PI_RM) CrErr Position */
#define SPW_LINK1_PI_RM_CRERR_Msk             (_U_(0x1) << SPW_LINK1_PI_RM_CRERR_Pos)              /**< (SPW_LINK1_PI_RM) CrErr Mask */
#define SPW_LINK1_PI_RM_CRERR(value)          (SPW_LINK1_PI_RM_CRERR_Msk & ((value) << SPW_LINK1_PI_RM_CRERR_Pos))
#define SPW_LINK1_PI_RM_LINKABORT_Pos         _U_(4)                                               /**< (SPW_LINK1_PI_RM) LinkAbort Position */
#define SPW_LINK1_PI_RM_LINKABORT_Msk         (_U_(0x1) << SPW_LINK1_PI_RM_LINKABORT_Pos)          /**< (SPW_LINK1_PI_RM) LinkAbort Mask */
#define SPW_LINK1_PI_RM_LINKABORT(value)      (SPW_LINK1_PI_RM_LINKABORT_Msk & ((value) << SPW_LINK1_PI_RM_LINKABORT_Pos))
#define SPW_LINK1_PI_RM_EEPTRANS_Pos          _U_(5)                                               /**< (SPW_LINK1_PI_RM) EEP transmitted Position */
#define SPW_LINK1_PI_RM_EEPTRANS_Msk          (_U_(0x1) << SPW_LINK1_PI_RM_EEPTRANS_Pos)           /**< (SPW_LINK1_PI_RM) EEP transmitted Mask */
#define SPW_LINK1_PI_RM_EEPTRANS(value)       (SPW_LINK1_PI_RM_EEPTRANS_Msk & ((value) << SPW_LINK1_PI_RM_EEPTRANS_Pos))
#define SPW_LINK1_PI_RM_EEPREC_Pos            _U_(6)                                               /**< (SPW_LINK1_PI_RM) EEP received Position */
#define SPW_LINK1_PI_RM_EEPREC_Msk            (_U_(0x1) << SPW_LINK1_PI_RM_EEPREC_Pos)             /**< (SPW_LINK1_PI_RM) EEP received Mask */
#define SPW_LINK1_PI_RM_EEPREC(value)         (SPW_LINK1_PI_RM_EEPREC_Msk & ((value) << SPW_LINK1_PI_RM_EEPREC_Pos))
#define SPW_LINK1_PI_RM_DISCARD_Pos           _U_(7)                                               /**< (SPW_LINK1_PI_RM) Discard Position */
#define SPW_LINK1_PI_RM_DISCARD_Msk           (_U_(0x1) << SPW_LINK1_PI_RM_DISCARD_Pos)            /**< (SPW_LINK1_PI_RM) Discard Mask */
#define SPW_LINK1_PI_RM_DISCARD(value)        (SPW_LINK1_PI_RM_DISCARD_Msk & ((value) << SPW_LINK1_PI_RM_DISCARD_Pos))
#define SPW_LINK1_PI_RM_ESCEVENT2_Pos         _U_(8)                                               /**< (SPW_LINK1_PI_RM) Escape Event 2 Position */
#define SPW_LINK1_PI_RM_ESCEVENT2_Msk         (_U_(0x1) << SPW_LINK1_PI_RM_ESCEVENT2_Pos)          /**< (SPW_LINK1_PI_RM) Escape Event 2 Mask */
#define SPW_LINK1_PI_RM_ESCEVENT2(value)      (SPW_LINK1_PI_RM_ESCEVENT2_Msk & ((value) << SPW_LINK1_PI_RM_ESCEVENT2_Pos))
#define SPW_LINK1_PI_RM_ESCEVENT1_Pos         _U_(9)                                               /**< (SPW_LINK1_PI_RM) Escape Event 1 Position */
#define SPW_LINK1_PI_RM_ESCEVENT1_Msk         (_U_(0x1) << SPW_LINK1_PI_RM_ESCEVENT1_Pos)          /**< (SPW_LINK1_PI_RM) Escape Event 1 Mask */
#define SPW_LINK1_PI_RM_ESCEVENT1(value)      (SPW_LINK1_PI_RM_ESCEVENT1_Msk & ((value) << SPW_LINK1_PI_RM_ESCEVENT1_Pos))
#define SPW_LINK1_PI_RM_Msk                   _U_(0x000003FF)                                      /**< (SPW_LINK1_PI_RM) Register Mask  */

#define SPW_LINK1_PI_RM_ESCEVENT_Pos          _U_(8)                                               /**< (SPW_LINK1_PI_RM Position) Escape Event x */
#define SPW_LINK1_PI_RM_ESCEVENT_Msk          (_U_(0x3) << SPW_LINK1_PI_RM_ESCEVENT_Pos)           /**< (SPW_LINK1_PI_RM Mask) ESCEVENT */
#define SPW_LINK1_PI_RM_ESCEVENT(value)       (SPW_LINK1_PI_RM_ESCEVENT_Msk & ((value) << SPW_LINK1_PI_RM_ESCEVENT_Pos)) 

/* -------- SPW_LINK1_PI_RCM : (SPW Offset: 0x404) ( R/ 32) SpW Link 1 Pending Read and Clear Masked Interrupt -------- */
#define SPW_LINK1_PI_RCM_DISERR_Pos           _U_(0)                                               /**< (SPW_LINK1_PI_RCM) DisErr Position */
#define SPW_LINK1_PI_RCM_DISERR_Msk           (_U_(0x1) << SPW_LINK1_PI_RCM_DISERR_Pos)            /**< (SPW_LINK1_PI_RCM) DisErr Mask */
#define SPW_LINK1_PI_RCM_DISERR(value)        (SPW_LINK1_PI_RCM_DISERR_Msk & ((value) << SPW_LINK1_PI_RCM_DISERR_Pos))
#define SPW_LINK1_PI_RCM_PARERR_Pos           _U_(1)                                               /**< (SPW_LINK1_PI_RCM) ParErr Position */
#define SPW_LINK1_PI_RCM_PARERR_Msk           (_U_(0x1) << SPW_LINK1_PI_RCM_PARERR_Pos)            /**< (SPW_LINK1_PI_RCM) ParErr Mask */
#define SPW_LINK1_PI_RCM_PARERR(value)        (SPW_LINK1_PI_RCM_PARERR_Msk & ((value) << SPW_LINK1_PI_RCM_PARERR_Pos))
#define SPW_LINK1_PI_RCM_ESCERR_Pos           _U_(2)                                               /**< (SPW_LINK1_PI_RCM) ESCErr Position */
#define SPW_LINK1_PI_RCM_ESCERR_Msk           (_U_(0x1) << SPW_LINK1_PI_RCM_ESCERR_Pos)            /**< (SPW_LINK1_PI_RCM) ESCErr Mask */
#define SPW_LINK1_PI_RCM_ESCERR(value)        (SPW_LINK1_PI_RCM_ESCERR_Msk & ((value) << SPW_LINK1_PI_RCM_ESCERR_Pos))
#define SPW_LINK1_PI_RCM_CRERR_Pos            _U_(3)                                               /**< (SPW_LINK1_PI_RCM) CrErr Position */
#define SPW_LINK1_PI_RCM_CRERR_Msk            (_U_(0x1) << SPW_LINK1_PI_RCM_CRERR_Pos)             /**< (SPW_LINK1_PI_RCM) CrErr Mask */
#define SPW_LINK1_PI_RCM_CRERR(value)         (SPW_LINK1_PI_RCM_CRERR_Msk & ((value) << SPW_LINK1_PI_RCM_CRERR_Pos))
#define SPW_LINK1_PI_RCM_LINKABORT_Pos        _U_(4)                                               /**< (SPW_LINK1_PI_RCM) LinkAbort Position */
#define SPW_LINK1_PI_RCM_LINKABORT_Msk        (_U_(0x1) << SPW_LINK1_PI_RCM_LINKABORT_Pos)         /**< (SPW_LINK1_PI_RCM) LinkAbort Mask */
#define SPW_LINK1_PI_RCM_LINKABORT(value)     (SPW_LINK1_PI_RCM_LINKABORT_Msk & ((value) << SPW_LINK1_PI_RCM_LINKABORT_Pos))
#define SPW_LINK1_PI_RCM_EEPTRANS_Pos         _U_(5)                                               /**< (SPW_LINK1_PI_RCM) EEP transmitted Position */
#define SPW_LINK1_PI_RCM_EEPTRANS_Msk         (_U_(0x1) << SPW_LINK1_PI_RCM_EEPTRANS_Pos)          /**< (SPW_LINK1_PI_RCM) EEP transmitted Mask */
#define SPW_LINK1_PI_RCM_EEPTRANS(value)      (SPW_LINK1_PI_RCM_EEPTRANS_Msk & ((value) << SPW_LINK1_PI_RCM_EEPTRANS_Pos))
#define SPW_LINK1_PI_RCM_EEPREC_Pos           _U_(6)                                               /**< (SPW_LINK1_PI_RCM) EEP received Position */
#define SPW_LINK1_PI_RCM_EEPREC_Msk           (_U_(0x1) << SPW_LINK1_PI_RCM_EEPREC_Pos)            /**< (SPW_LINK1_PI_RCM) EEP received Mask */
#define SPW_LINK1_PI_RCM_EEPREC(value)        (SPW_LINK1_PI_RCM_EEPREC_Msk & ((value) << SPW_LINK1_PI_RCM_EEPREC_Pos))
#define SPW_LINK1_PI_RCM_DISCARD_Pos          _U_(7)                                               /**< (SPW_LINK1_PI_RCM) Discard Position */
#define SPW_LINK1_PI_RCM_DISCARD_Msk          (_U_(0x1) << SPW_LINK1_PI_RCM_DISCARD_Pos)           /**< (SPW_LINK1_PI_RCM) Discard Mask */
#define SPW_LINK1_PI_RCM_DISCARD(value)       (SPW_LINK1_PI_RCM_DISCARD_Msk & ((value) << SPW_LINK1_PI_RCM_DISCARD_Pos))
#define SPW_LINK1_PI_RCM_ESCEVENT2_Pos        _U_(8)                                               /**< (SPW_LINK1_PI_RCM) Escape Event 2 Position */
#define SPW_LINK1_PI_RCM_ESCEVENT2_Msk        (_U_(0x1) << SPW_LINK1_PI_RCM_ESCEVENT2_Pos)         /**< (SPW_LINK1_PI_RCM) Escape Event 2 Mask */
#define SPW_LINK1_PI_RCM_ESCEVENT2(value)     (SPW_LINK1_PI_RCM_ESCEVENT2_Msk & ((value) << SPW_LINK1_PI_RCM_ESCEVENT2_Pos))
#define SPW_LINK1_PI_RCM_ESCEVENT1_Pos        _U_(9)                                               /**< (SPW_LINK1_PI_RCM) Escape Event 1 Position */
#define SPW_LINK1_PI_RCM_ESCEVENT1_Msk        (_U_(0x1) << SPW_LINK1_PI_RCM_ESCEVENT1_Pos)         /**< (SPW_LINK1_PI_RCM) Escape Event 1 Mask */
#define SPW_LINK1_PI_RCM_ESCEVENT1(value)     (SPW_LINK1_PI_RCM_ESCEVENT1_Msk & ((value) << SPW_LINK1_PI_RCM_ESCEVENT1_Pos))
#define SPW_LINK1_PI_RCM_Msk                  _U_(0x000003FF)                                      /**< (SPW_LINK1_PI_RCM) Register Mask  */

#define SPW_LINK1_PI_RCM_ESCEVENT_Pos         _U_(8)                                               /**< (SPW_LINK1_PI_RCM Position) Escape Event x */
#define SPW_LINK1_PI_RCM_ESCEVENT_Msk         (_U_(0x3) << SPW_LINK1_PI_RCM_ESCEVENT_Pos)          /**< (SPW_LINK1_PI_RCM Mask) ESCEVENT */
#define SPW_LINK1_PI_RCM_ESCEVENT(value)      (SPW_LINK1_PI_RCM_ESCEVENT_Msk & ((value) << SPW_LINK1_PI_RCM_ESCEVENT_Pos)) 

/* -------- SPW_LINK1_PI_R : (SPW Offset: 0x408) ( R/ 32) SpW Link 1 Pending Read Interrupt -------- */
#define SPW_LINK1_PI_R_DISERR_Pos             _U_(0)                                               /**< (SPW_LINK1_PI_R) DisErr Position */
#define SPW_LINK1_PI_R_DISERR_Msk             (_U_(0x1) << SPW_LINK1_PI_R_DISERR_Pos)              /**< (SPW_LINK1_PI_R) DisErr Mask */
#define SPW_LINK1_PI_R_DISERR(value)          (SPW_LINK1_PI_R_DISERR_Msk & ((value) << SPW_LINK1_PI_R_DISERR_Pos))
#define SPW_LINK1_PI_R_PARERR_Pos             _U_(1)                                               /**< (SPW_LINK1_PI_R) ParErr Position */
#define SPW_LINK1_PI_R_PARERR_Msk             (_U_(0x1) << SPW_LINK1_PI_R_PARERR_Pos)              /**< (SPW_LINK1_PI_R) ParErr Mask */
#define SPW_LINK1_PI_R_PARERR(value)          (SPW_LINK1_PI_R_PARERR_Msk & ((value) << SPW_LINK1_PI_R_PARERR_Pos))
#define SPW_LINK1_PI_R_ESCERR_Pos             _U_(2)                                               /**< (SPW_LINK1_PI_R) ESCErr Position */
#define SPW_LINK1_PI_R_ESCERR_Msk             (_U_(0x1) << SPW_LINK1_PI_R_ESCERR_Pos)              /**< (SPW_LINK1_PI_R) ESCErr Mask */
#define SPW_LINK1_PI_R_ESCERR(value)          (SPW_LINK1_PI_R_ESCERR_Msk & ((value) << SPW_LINK1_PI_R_ESCERR_Pos))
#define SPW_LINK1_PI_R_CRERR_Pos              _U_(3)                                               /**< (SPW_LINK1_PI_R) CrErr Position */
#define SPW_LINK1_PI_R_CRERR_Msk              (_U_(0x1) << SPW_LINK1_PI_R_CRERR_Pos)               /**< (SPW_LINK1_PI_R) CrErr Mask */
#define SPW_LINK1_PI_R_CRERR(value)           (SPW_LINK1_PI_R_CRERR_Msk & ((value) << SPW_LINK1_PI_R_CRERR_Pos))
#define SPW_LINK1_PI_R_LINKABORT_Pos          _U_(4)                                               /**< (SPW_LINK1_PI_R) LinkAbort Position */
#define SPW_LINK1_PI_R_LINKABORT_Msk          (_U_(0x1) << SPW_LINK1_PI_R_LINKABORT_Pos)           /**< (SPW_LINK1_PI_R) LinkAbort Mask */
#define SPW_LINK1_PI_R_LINKABORT(value)       (SPW_LINK1_PI_R_LINKABORT_Msk & ((value) << SPW_LINK1_PI_R_LINKABORT_Pos))
#define SPW_LINK1_PI_R_EEPTRANS_Pos           _U_(5)                                               /**< (SPW_LINK1_PI_R) EEP transmitted Position */
#define SPW_LINK1_PI_R_EEPTRANS_Msk           (_U_(0x1) << SPW_LINK1_PI_R_EEPTRANS_Pos)            /**< (SPW_LINK1_PI_R) EEP transmitted Mask */
#define SPW_LINK1_PI_R_EEPTRANS(value)        (SPW_LINK1_PI_R_EEPTRANS_Msk & ((value) << SPW_LINK1_PI_R_EEPTRANS_Pos))
#define SPW_LINK1_PI_R_EEPREC_Pos             _U_(6)                                               /**< (SPW_LINK1_PI_R) EEP received Position */
#define SPW_LINK1_PI_R_EEPREC_Msk             (_U_(0x1) << SPW_LINK1_PI_R_EEPREC_Pos)              /**< (SPW_LINK1_PI_R) EEP received Mask */
#define SPW_LINK1_PI_R_EEPREC(value)          (SPW_LINK1_PI_R_EEPREC_Msk & ((value) << SPW_LINK1_PI_R_EEPREC_Pos))
#define SPW_LINK1_PI_R_DISCARD_Pos            _U_(7)                                               /**< (SPW_LINK1_PI_R) Discard Position */
#define SPW_LINK1_PI_R_DISCARD_Msk            (_U_(0x1) << SPW_LINK1_PI_R_DISCARD_Pos)             /**< (SPW_LINK1_PI_R) Discard Mask */
#define SPW_LINK1_PI_R_DISCARD(value)         (SPW_LINK1_PI_R_DISCARD_Msk & ((value) << SPW_LINK1_PI_R_DISCARD_Pos))
#define SPW_LINK1_PI_R_ESCEVENT2_Pos          _U_(8)                                               /**< (SPW_LINK1_PI_R) Escape Event 2 Position */
#define SPW_LINK1_PI_R_ESCEVENT2_Msk          (_U_(0x1) << SPW_LINK1_PI_R_ESCEVENT2_Pos)           /**< (SPW_LINK1_PI_R) Escape Event 2 Mask */
#define SPW_LINK1_PI_R_ESCEVENT2(value)       (SPW_LINK1_PI_R_ESCEVENT2_Msk & ((value) << SPW_LINK1_PI_R_ESCEVENT2_Pos))
#define SPW_LINK1_PI_R_ESCEVENT1_Pos          _U_(9)                                               /**< (SPW_LINK1_PI_R) Escape Event 1 Position */
#define SPW_LINK1_PI_R_ESCEVENT1_Msk          (_U_(0x1) << SPW_LINK1_PI_R_ESCEVENT1_Pos)           /**< (SPW_LINK1_PI_R) Escape Event 1 Mask */
#define SPW_LINK1_PI_R_ESCEVENT1(value)       (SPW_LINK1_PI_R_ESCEVENT1_Msk & ((value) << SPW_LINK1_PI_R_ESCEVENT1_Pos))
#define SPW_LINK1_PI_R_Msk                    _U_(0x000003FF)                                      /**< (SPW_LINK1_PI_R) Register Mask  */

#define SPW_LINK1_PI_R_ESCEVENT_Pos           _U_(8)                                               /**< (SPW_LINK1_PI_R Position) Escape Event x */
#define SPW_LINK1_PI_R_ESCEVENT_Msk           (_U_(0x3) << SPW_LINK1_PI_R_ESCEVENT_Pos)            /**< (SPW_LINK1_PI_R Mask) ESCEVENT */
#define SPW_LINK1_PI_R_ESCEVENT(value)        (SPW_LINK1_PI_R_ESCEVENT_Msk & ((value) << SPW_LINK1_PI_R_ESCEVENT_Pos)) 

