Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/spw.h
#define SPW_LINK1_IM_S_ESCEVENT_Pos           _U_(8)                                               /**< (SPW_LINK1_IM_S Position) Escape Event x */
#define SPW_LINK1_IM_S_ESCEVENT_Msk           (_U_(0x3) << SPW_LINK1_IM_S_ESCEVENT_Pos)            /**< (SPW_LINK1_IM_S Mask) ESCEVENT */
#define SPW_LINK1_IM_S_ESCEVENT(value)        (SPW_LINK1_IM_S_ESCEVENT_Msk & ((value) << SPW_LINK1_IM_S_ESCEVENT_Pos)) 

/* -------- SPW_LINK1_IM_C : (SPW Offset: 0x41C) ( /W 32) SpW Link 1 Interrupt Clear Mask -------- */
#define SPW_LINK1_IM_C_DISERR_Pos             _U_(0)                                               /**< (SPW_LINK1_IM_C) DisErr Position */
#define SPW_LINK1_IM_C_DISERR_Msk             (_U_(0x1) << SPW_LINK1_IM_C_DISERR_Pos)              /**< (SPW_LINK1_IM_C) DisErr Mask */
#define SPW_LINK1_IM_C_DISERR(value)          (SPW_LINK1_IM_C_DISERR_Msk & ((value) << SPW_LINK1_IM_C_DISERR_Pos))
#define SPW_LINK1_IM_C_PARERR_Pos             _U_(1)                                               /**< (SPW_LINK1_IM_C) ParErr Position */
#define SPW_LINK1_IM_C_PARERR_Msk             (_U_(0x1) << SPW_LINK1_IM_C_PARERR_Pos)              /**< (SPW_LINK1_IM_C) ParErr Mask */
#define SPW_LINK1_IM_C_PARERR(value)          (SPW_LINK1_IM_C_PARERR_Msk & ((value) << SPW_LINK1_IM_C_PARERR_Pos))
#define SPW_LINK1_IM_C_ESCERR_Pos             _U_(2)                                               /**< (SPW_LINK1_IM_C) ESCErr Position */
#define SPW_LINK1_IM_C_ESCERR_Msk             (_U_(0x1) << SPW_LINK1_IM_C_ESCERR_Pos)              /**< (SPW_LINK1_IM_C) ESCErr Mask */
#define SPW_LINK1_IM_C_ESCERR(value)          (SPW_LINK1_IM_C_ESCERR_Msk & ((value) << SPW_LINK1_IM_C_ESCERR_Pos))
#define SPW_LINK1_IM_C_CRERR_Pos              _U_(3)                                               /**< (SPW_LINK1_IM_C) CrErr Position */
#define SPW_LINK1_IM_C_CRERR_Msk              (_U_(0x1) << SPW_LINK1_IM_C_CRERR_Pos)               /**< (SPW_LINK1_IM_C) CrErr Mask */
#define SPW_LINK1_IM_C_CRERR(value)           (SPW_LINK1_IM_C_CRERR_Msk & ((value) << SPW_LINK1_IM_C_CRERR_Pos))
#define SPW_LINK1_IM_C_LINKABORT_Pos          _U_(4)                                               /**< (SPW_LINK1_IM_C) LinkAbort Position */
#define SPW_LINK1_IM_C_LINKABORT_Msk          (_U_(0x1) << SPW_LINK1_IM_C_LINKABORT_Pos)           /**< (SPW_LINK1_IM_C) LinkAbort Mask */
#define SPW_LINK1_IM_C_LINKABORT(value)       (SPW_LINK1_IM_C_LINKABORT_Msk & ((value) << SPW_LINK1_IM_C_LINKABORT_Pos))
#define SPW_LINK1_IM_C_EEPTRANS_Pos           _U_(5)                                               /**< (SPW_LINK1_IM_C) EEP transmitted Position */
#define SPW_LINK1_IM_C_EEPTRANS_Msk           (_U_(0x1) << SPW_LINK1_IM_C_EEPTRANS_Pos)            /**< (SPW_LINK1_IM_C) EEP transmitted Mask */
#define SPW_LINK1_IM_C_EEPTRANS(value)        (SPW_LINK1_IM_C_EEPTRANS_Msk & ((value) << SPW_LINK1_IM_C_EEPTRANS_Pos))
#define SPW_LINK1_IM_C_EEPREC_Pos             _U_(6)                                               /**< (SPW_LINK1_IM_C) EEP received Position */
#define SPW_LINK1_IM_C_EEPREC_Msk             (_U_(0x1) << SPW_LINK1_IM_C_EEPREC_Pos)              /**< (SPW_LINK1_IM_C) EEP received Mask */
#define SPW_LINK1_IM_C_EEPREC(value)          (SPW_LINK1_IM_C_EEPREC_Msk & ((value) << SPW_LINK1_IM_C_EEPREC_Pos))
#define SPW_LINK1_IM_C_DISCARD_Pos            _U_(7)                                               /**< (SPW_LINK1_IM_C) Discard Position */
#define SPW_LINK1_IM_C_DISCARD_Msk            (_U_(0x1) << SPW_LINK1_IM_C_DISCARD_Pos)             /**< (SPW_LINK1_IM_C) Discard Mask */
#define SPW_LINK1_IM_C_DISCARD(value)         (SPW_LINK1_IM_C_DISCARD_Msk & ((value) << SPW_LINK1_IM_C_DISCARD_Pos))
#define SPW_LINK1_IM_C_ESCEVENT2_Pos          _U_(8)                                               /**< (SPW_LINK1_IM_C) Escape Event 2 Position */
#define SPW_LINK1_IM_C_ESCEVENT2_Msk          (_U_(0x1) << SPW_LINK1_IM_C_ESCEVENT2_Pos)           /**< (SPW_LINK1_IM_C) Escape Event 2 Mask */
#define SPW_LINK1_IM_C_ESCEVENT2(value)       (SPW_LINK1_IM_C_ESCEVENT2_Msk & ((value) << SPW_LINK1_IM_C_ESCEVENT2_Pos))
#define SPW_LINK1_IM_C_ESCEVENT1_Pos          _U_(9)                                               /**< (SPW_LINK1_IM_C) Escape Event 1 Position */
#define SPW_LINK1_IM_C_ESCEVENT1_Msk          (_U_(0x1) << SPW_LINK1_IM_C_ESCEVENT1_Pos)           /**< (SPW_LINK1_IM_C) Escape Event 1 Mask */
#define SPW_LINK1_IM_C_ESCEVENT1(value)       (SPW_LINK1_IM_C_ESCEVENT1_Msk & ((value) << SPW_LINK1_IM_C_ESCEVENT1_Pos))
#define SPW_LINK1_IM_C_Msk                    _U_(0x000003FF)                                      /**< (SPW_LINK1_IM_C) Register Mask  */

#define SPW_LINK1_IM_C_ESCEVENT_Pos           _U_(8)                                               /**< (SPW_LINK1_IM_C Position) Escape Event x */
#define SPW_LINK1_IM_C_ESCEVENT_Msk           (_U_(0x3) << SPW_LINK1_IM_C_ESCEVENT_Pos)            /**< (SPW_LINK1_IM_C Mask) ESCEVENT */
#define SPW_LINK1_IM_C_ESCEVENT(value)        (SPW_LINK1_IM_C_ESCEVENT_Msk & ((value) << SPW_LINK1_IM_C_ESCEVENT_Pos)) 

/* -------- SPW_LINK1_CFG : (SPW Offset: 0x420) (R/W 32) SpW Link 1 Config -------- */
#define SPW_LINK1_CFG_COMMAND_Pos             _U_(0)                                               /**< (SPW_LINK1_CFG) Command Position */
#define SPW_LINK1_CFG_COMMAND_Msk             (_U_(0x3) << SPW_LINK1_CFG_COMMAND_Pos)              /**< (SPW_LINK1_CFG) Command Mask */
#define SPW_LINK1_CFG_COMMAND(value)          (SPW_LINK1_CFG_COMMAND_Msk & ((value) << SPW_LINK1_CFG_COMMAND_Pos))
#define   SPW_LINK1_CFG_COMMAND_LINK_DISABLE_Val _U_(0x0)                                             /**< (SPW_LINK1_CFG) The link proceeds directly to the ErrorReset state when reaching the Run state.  */
#define   SPW_LINK1_CFG_COMMAND_NO_COMMAND_Val _U_(0x1)                                             /**< (SPW_LINK1_CFG) State is not actively changed.  */
#define   SPW_LINK1_CFG_COMMAND_AUTO_START_Val _U_(0x2)                                             /**< (SPW_LINK1_CFG) The Codec will wait in state Ready until the first NULL character is received.  */
#define   SPW_LINK1_CFG_COMMAND_LINK_START_Val _U_(0x3)                                             /**< (SPW_LINK1_CFG) SpaceWire link can proceed to Started state.  */
#define SPW_LINK1_CFG_COMMAND_LINK_DISABLE    (SPW_LINK1_CFG_COMMAND_LINK_DISABLE_Val << SPW_LINK1_CFG_COMMAND_Pos) /**< (SPW_LINK1_CFG) The link proceeds directly to the ErrorReset state when reaching the Run state. Position  */
#define SPW_LINK1_CFG_COMMAND_NO_COMMAND      (SPW_LINK1_CFG_COMMAND_NO_COMMAND_Val << SPW_LINK1_CFG_COMMAND_Pos) /**< (SPW_LINK1_CFG) State is not actively changed. Position  */
#define SPW_LINK1_CFG_COMMAND_AUTO_START      (SPW_LINK1_CFG_COMMAND_AUTO_START_Val << SPW_LINK1_CFG_COMMAND_Pos) /**< (SPW_LINK1_CFG) The Codec will wait in state Ready until the first NULL character is received. Position  */
#define SPW_LINK1_CFG_COMMAND_LINK_START      (SPW_LINK1_CFG_COMMAND_LINK_START_Val << SPW_LINK1_CFG_COMMAND_Pos) /**< (SPW_LINK1_CFG) SpaceWire link can proceed to Started state. Position  */
#define SPW_LINK1_CFG_Msk                     _U_(0x00000003)                                      /**< (SPW_LINK1_CFG) Register Mask  */


/* -------- SPW_LINK1_CLKDIV : (SPW Offset: 0x424) (R/W 32) SpW Link 1 Clock Division -------- */
#define SPW_LINK1_CLKDIV_TXOPERDIV_Pos        _U_(0)                                               /**< (SPW_LINK1_CLKDIV) TxOperDiv Position */
#define SPW_LINK1_CLKDIV_TXOPERDIV_Msk        (_U_(0x1F) << SPW_LINK1_CLKDIV_TXOPERDIV_Pos)        /**< (SPW_LINK1_CLKDIV) TxOperDiv Mask */
#define SPW_LINK1_CLKDIV_TXOPERDIV(value)     (SPW_LINK1_CLKDIV_TXOPERDIV_Msk & ((value) << SPW_LINK1_CLKDIV_TXOPERDIV_Pos))
#define SPW_LINK1_CLKDIV_TXINITDIV_Pos        _U_(16)                                              /**< (SPW_LINK1_CLKDIV) TxInitDiv Position */
#define SPW_LINK1_CLKDIV_TXINITDIV_Msk        (_U_(0x1F) << SPW_LINK1_CLKDIV_TXINITDIV_Pos)        /**< (SPW_LINK1_CLKDIV) TxInitDiv Mask */
#define SPW_LINK1_CLKDIV_TXINITDIV(value)     (SPW_LINK1_CLKDIV_TXINITDIV_Msk & ((value) << SPW_LINK1_CLKDIV_TXINITDIV_Pos))
#define SPW_LINK1_CLKDIV_Msk                  _U_(0x001F001F)                                      /**< (SPW_LINK1_CLKDIV) Register Mask  */


/* -------- SPW_LINK1_STATUS : (SPW Offset: 0x428) ( R/ 32) SpW Link 1 Status -------- */
#define SPW_LINK1_STATUS_LINKSTATE_Pos        _U_(0)                                               /**< (SPW_LINK1_STATUS) LinkState Position */
#define SPW_LINK1_STATUS_LINKSTATE_Msk        (_U_(0x7) << SPW_LINK1_STATUS_LINKSTATE_Pos)         /**< (SPW_LINK1_STATUS) LinkState Mask */
#define SPW_LINK1_STATUS_LINKSTATE(value)     (SPW_LINK1_STATUS_LINKSTATE_Msk & ((value) << SPW_LINK1_STATUS_LINKSTATE_Pos))
#define   SPW_LINK1_STATUS_LINKSTATE_ERRORRESET_Val _U_(0x0)                                             /**< (SPW_LINK1_STATUS) CODEC link state machine in ErrorReset state  */
#define   SPW_LINK1_STATUS_LINKSTATE_ERRORWAIT_Val _U_(0x1)                                             /**< (SPW_LINK1_STATUS) CODEC link state machine in ErrorWait state  */
#define   SPW_LINK1_STATUS_LINKSTATE_READY_Val _U_(0x2)                                             /**< (SPW_LINK1_STATUS) CODEC link state machine in Ready state  */
#define   SPW_LINK1_STATUS_LINKSTATE_STARTED_Val _U_(0x3)                                             /**< (SPW_LINK1_STATUS) CODEC link state machine in Started state  */
#define   SPW_LINK1_STATUS_LINKSTATE_CONNECTING_Val _U_(0x4)                                             /**< (SPW_LINK1_STATUS) CODEC link state machine in Connecting state  */
#define   SPW_LINK1_STATUS_LINKSTATE_RUN_Val  _U_(0x5)                                             /**< (SPW_LINK1_STATUS) CODEC link state machine in Run state  */
#define SPW_LINK1_STATUS_LINKSTATE_ERRORRESET (SPW_LINK1_STATUS_LINKSTATE_ERRORRESET_Val << SPW_LINK1_STATUS_LINKSTATE_Pos) /**< (SPW_LINK1_STATUS) CODEC link state machine in ErrorReset state Position  */
#define SPW_LINK1_STATUS_LINKSTATE_ERRORWAIT  (SPW_LINK1_STATUS_LINKSTATE_ERRORWAIT_Val << SPW_LINK1_STATUS_LINKSTATE_Pos) /**< (SPW_LINK1_STATUS) CODEC link state machine in ErrorWait state Position  */
#define SPW_LINK1_STATUS_LINKSTATE_READY      (SPW_LINK1_STATUS_LINKSTATE_READY_Val << SPW_LINK1_STATUS_LINKSTATE_Pos) /**< (SPW_LINK1_STATUS) CODEC link state machine in Ready state Position  */
#define SPW_LINK1_STATUS_LINKSTATE_STARTED    (SPW_LINK1_STATUS_LINKSTATE_STARTED_Val << SPW_LINK1_STATUS_LINKSTATE_Pos) /**< (SPW_LINK1_STATUS) CODEC link state machine in Started state Position  */
#define SPW_LINK1_STATUS_LINKSTATE_CONNECTING (SPW_LINK1_STATUS_LINKSTATE_CONNECTING_Val << SPW_LINK1_STATUS_LINKSTATE_Pos) /**< (SPW_LINK1_STATUS) CODEC link state machine in Connecting state Position  */
#define SPW_LINK1_STATUS_LINKSTATE_RUN        (SPW_LINK1_STATUS_LINKSTATE_RUN_Val << SPW_LINK1_STATUS_LINKSTATE_Pos) /**< (SPW_LINK1_STATUS) CODEC link state machine in Run state Position  */
#define SPW_LINK1_STATUS_TXDEFDIV_Pos         _U_(4)                                               /**< (SPW_LINK1_STATUS) TxDefDiv Position */
#define SPW_LINK1_STATUS_TXDEFDIV_Msk         (_U_(0x1F) << SPW_LINK1_STATUS_TXDEFDIV_Pos)         /**< (SPW_LINK1_STATUS) TxDefDiv Mask */
#define SPW_LINK1_STATUS_TXDEFDIV(value)      (SPW_LINK1_STATUS_TXDEFDIV_Msk & ((value) << SPW_LINK1_STATUS_TXDEFDIV_Pos))
#define SPW_LINK1_STATUS_TXEMPTY_Pos          _U_(16)                                              /**< (SPW_LINK1_STATUS) TxEmpty Position */
#define SPW_LINK1_STATUS_TXEMPTY_Msk          (_U_(0x1) << SPW_LINK1_STATUS_TXEMPTY_Pos)           /**< (SPW_LINK1_STATUS) TxEmpty Mask */
#define SPW_LINK1_STATUS_TXEMPTY(value)       (SPW_LINK1_STATUS_TXEMPTY_Msk & ((value) << SPW_LINK1_STATUS_TXEMPTY_Pos))
#define SPW_LINK1_STATUS_GOTNULL_Pos          _U_(17)                                              /**< (SPW_LINK1_STATUS) GotNull Position */
#define SPW_LINK1_STATUS_GOTNULL_Msk          (_U_(0x1) << SPW_LINK1_STATUS_GOTNULL_Pos)           /**< (SPW_LINK1_STATUS) GotNull Mask */
#define SPW_LINK1_STATUS_GOTNULL(value)       (SPW_LINK1_STATUS_GOTNULL_Msk & ((value) << SPW_LINK1_STATUS_GOTNULL_Pos))
#define SPW_LINK1_STATUS_GOTFCT_Pos           _U_(18)                                              /**< (SPW_LINK1_STATUS) GotFCT Position */
#define SPW_LINK1_STATUS_GOTFCT_Msk           (_U_(0x1) << SPW_LINK1_STATUS_GOTFCT_Pos)            /**< (SPW_LINK1_STATUS) GotFCT Mask */
#define SPW_LINK1_STATUS_GOTFCT(value)        (SPW_LINK1_STATUS_GOTFCT_Msk & ((value) << SPW_LINK1_STATUS_GOTFCT_Pos))
#define SPW_LINK1_STATUS_GOTNCHAR_Pos         _U_(19)                                              /**< (SPW_LINK1_STATUS) GotNChar Position */
#define SPW_LINK1_STATUS_GOTNCHAR_Msk         (_U_(0x1) << SPW_LINK1_STATUS_GOTNCHAR_Pos)          /**< (SPW_LINK1_STATUS) GotNChar Mask */
#define SPW_LINK1_STATUS_GOTNCHAR(value)      (SPW_LINK1_STATUS_GOTNCHAR_Msk & ((value) << SPW_LINK1_STATUS_GOTNCHAR_Pos))
#define SPW_LINK1_STATUS_SEEN0_Pos            _U_(20)                                              /**< (SPW_LINK1_STATUS) SEEN0 Position */
#define SPW_LINK1_STATUS_SEEN0_Msk            (_U_(0x1) << SPW_LINK1_STATUS_SEEN0_Pos)             /**< (SPW_LINK1_STATUS) SEEN0 Mask */
#define SPW_LINK1_STATUS_SEEN0(value)         (SPW_LINK1_STATUS_SEEN0_Msk & ((value) << SPW_LINK1_STATUS_SEEN0_Pos))
#define SPW_LINK1_STATUS_SEEN1_Pos            _U_(21)                                              /**< (SPW_LINK1_STATUS) SEEN1 Position */
#define SPW_LINK1_STATUS_SEEN1_Msk            (_U_(0x1) << SPW_LINK1_STATUS_SEEN1_Pos)             /**< (SPW_LINK1_STATUS) SEEN1 Mask */
#define SPW_LINK1_STATUS_SEEN1(value)         (SPW_LINK1_STATUS_SEEN1_Msk & ((value) << SPW_LINK1_STATUS_SEEN1_Pos))
#define SPW_LINK1_STATUS_SEEN2_Pos            _U_(22)                                              /**< (SPW_LINK1_STATUS) SEEN2 Position */
#define SPW_LINK1_STATUS_SEEN2_Msk            (_U_(0x1) << SPW_LINK1_STATUS_SEEN2_Pos)             /**< (SPW_LINK1_STATUS) SEEN2 Mask */
#define SPW_LINK1_STATUS_SEEN2(value)         (SPW_LINK1_STATUS_SEEN2_Msk & ((value) << SPW_LINK1_STATUS_SEEN2_Pos))
#define SPW_LINK1_STATUS_SEEN3_Pos            _U_(23)                                              /**< (SPW_LINK1_STATUS) SEEN3 Position */
#define SPW_LINK1_STATUS_SEEN3_Msk            (_U_(0x1) << SPW_LINK1_STATUS_SEEN3_Pos)             /**< (SPW_LINK1_STATUS) SEEN3 Mask */
#define SPW_LINK1_STATUS_SEEN3(value)         (SPW_LINK1_STATUS_SEEN3_Msk & ((value) << SPW_LINK1_STATUS_SEEN3_Pos))
#define SPW_LINK1_STATUS_SEEN4_Pos            _U_(24)                                              /**< (SPW_LINK1_STATUS) SEEN4 Position */
#define SPW_LINK1_STATUS_SEEN4_Msk            (_U_(0x1) << SPW_LINK1_STATUS_SEEN4_Pos)             /**< (SPW_LINK1_STATUS) SEEN4 Mask */
#define SPW_LINK1_STATUS_SEEN4(value)         (SPW_LINK1_STATUS_SEEN4_Msk & ((value) << SPW_LINK1_STATUS_SEEN4_Pos))
#define SPW_LINK1_STATUS_SEEN5_Pos            _U_(25)                                              /**< (SPW_LINK1_STATUS) SEEN5 Position */
#define SPW_LINK1_STATUS_SEEN5_Msk            (_U_(0x1) << SPW_LINK1_STATUS_SEEN5_Pos)             /**< (SPW_LINK1_STATUS) SEEN5 Mask */
#define SPW_LINK1_STATUS_SEEN5(value)         (SPW_LINK1_STATUS_SEEN5_Msk & ((value) << SPW_LINK1_STATUS_SEEN5_Pos))
#define SPW_LINK1_STATUS_Msk                  _U_(0x03FF01F7)                                      /**< (SPW_LINK1_STATUS) Register Mask  */

#define SPW_LINK1_STATUS_SEEN_Pos             _U_(20)                                              /**< (SPW_LINK1_STATUS Position) SEEN5 */
#define SPW_LINK1_STATUS_SEEN_Msk             (_U_(0x3F) << SPW_LINK1_STATUS_SEEN_Pos)             /**< (SPW_LINK1_STATUS Mask) SEEN */
#define SPW_LINK1_STATUS_SEEN(value)          (SPW_LINK1_STATUS_SEEN_Msk & ((value) << SPW_LINK1_STATUS_SEEN_Pos)) 

/* -------- SPW_LINK1_SWRESET : (SPW Offset: 0x42C) (R/W 32) SpW Link 1 Software Reset -------- */
#define SPW_LINK1_SWRESET_PATTERN_Pos         _U_(0)                                               /**< (SPW_LINK1_SWRESET) Pattern Position */
#define SPW_LINK1_SWRESET_PATTERN_Msk         (_U_(0xFFFFFFFF) << SPW_LINK1_SWRESET_PATTERN_Pos)   /**< (SPW_LINK1_SWRESET) Pattern Mask */
#define SPW_LINK1_SWRESET_PATTERN(value)      (SPW_LINK1_SWRESET_PATTERN_Msk & ((value) << SPW_LINK1_SWRESET_PATTERN_Pos))
#define SPW_LINK1_SWRESET_Msk                 _U_(0xFFFFFFFF)                                      /**< (SPW_LINK1_SWRESET) Register Mask  */


