Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/spw.h
#define SPW_LINK1_DISTACKPI_RM_DA_Pos         _U_(0)                                               /**< (SPW_LINK1_DISTACKPI_RM Position) Distributed Acknowledge */
#define SPW_LINK1_DISTACKPI_RM_DA_Msk         (_U_(0xFFFFFFFF) << SPW_LINK1_DISTACKPI_RM_DA_Pos)   /**< (SPW_LINK1_DISTACKPI_RM Mask) DA */
#define SPW_LINK1_DISTACKPI_RM_DA(value)      (SPW_LINK1_DISTACKPI_RM_DA_Msk & ((value) << SPW_LINK1_DISTACKPI_RM_DA_Pos)) 

/* -------- SPW_LINK1_DISTACKPI_RCM : (SPW Offset: 0x464) ( R/ 32) SpW Link 1 Distributed Interrupt Acknowledge Pending Read and Clear Masked Interrupt -------- */
#define SPW_LINK1_DISTACKPI_RCM_DA0_Pos       _U_(0)                                               /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA0_Msk       (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA0_Pos)        /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA0(value)    (SPW_LINK1_DISTACKPI_RCM_DA0_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA0_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA1_Pos       _U_(1)                                               /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA1_Msk       (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA1_Pos)        /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA1(value)    (SPW_LINK1_DISTACKPI_RCM_DA1_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA1_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA2_Pos       _U_(2)                                               /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA2_Msk       (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA2_Pos)        /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA2(value)    (SPW_LINK1_DISTACKPI_RCM_DA2_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA2_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA3_Pos       _U_(3)                                               /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA3_Msk       (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA3_Pos)        /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA3(value)    (SPW_LINK1_DISTACKPI_RCM_DA3_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA3_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA4_Pos       _U_(4)                                               /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA4_Msk       (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA4_Pos)        /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA4(value)    (SPW_LINK1_DISTACKPI_RCM_DA4_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA4_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA5_Pos       _U_(5)                                               /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA5_Msk       (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA5_Pos)        /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA5(value)    (SPW_LINK1_DISTACKPI_RCM_DA5_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA5_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA6_Pos       _U_(6)                                               /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA6_Msk       (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA6_Pos)        /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA6(value)    (SPW_LINK1_DISTACKPI_RCM_DA6_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA6_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA7_Pos       _U_(7)                                               /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA7_Msk       (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA7_Pos)        /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA7(value)    (SPW_LINK1_DISTACKPI_RCM_DA7_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA7_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA8_Pos       _U_(8)                                               /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA8_Msk       (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA8_Pos)        /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA8(value)    (SPW_LINK1_DISTACKPI_RCM_DA8_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA8_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA9_Pos       _U_(9)                                               /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA9_Msk       (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA9_Pos)        /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA9(value)    (SPW_LINK1_DISTACKPI_RCM_DA9_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA9_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA10_Pos      _U_(10)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA10_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA10_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA10(value)   (SPW_LINK1_DISTACKPI_RCM_DA10_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA10_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA11_Pos      _U_(11)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA11_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA11_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA11(value)   (SPW_LINK1_DISTACKPI_RCM_DA11_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA11_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA12_Pos      _U_(12)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA12_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA12_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA12(value)   (SPW_LINK1_DISTACKPI_RCM_DA12_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA12_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA13_Pos      _U_(13)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA13_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA13_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA13(value)   (SPW_LINK1_DISTACKPI_RCM_DA13_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA13_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA14_Pos      _U_(14)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA14_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA14_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA14(value)   (SPW_LINK1_DISTACKPI_RCM_DA14_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA14_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA15_Pos      _U_(15)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA15_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA15_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA15(value)   (SPW_LINK1_DISTACKPI_RCM_DA15_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA15_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA16_Pos      _U_(16)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA16_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA16_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA16(value)   (SPW_LINK1_DISTACKPI_RCM_DA16_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA16_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA17_Pos      _U_(17)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA17_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA17_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA17(value)   (SPW_LINK1_DISTACKPI_RCM_DA17_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA17_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA18_Pos      _U_(18)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA18_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA18_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA18(value)   (SPW_LINK1_DISTACKPI_RCM_DA18_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA18_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA19_Pos      _U_(19)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA19_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA19_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA19(value)   (SPW_LINK1_DISTACKPI_RCM_DA19_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA19_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA20_Pos      _U_(20)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA20_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA20_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA20(value)   (SPW_LINK1_DISTACKPI_RCM_DA20_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA20_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA21_Pos      _U_(21)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA21_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA21_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA21(value)   (SPW_LINK1_DISTACKPI_RCM_DA21_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA21_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA22_Pos      _U_(22)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA22_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA22_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA22(value)   (SPW_LINK1_DISTACKPI_RCM_DA22_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA22_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA23_Pos      _U_(23)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA23_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA23_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA23(value)   (SPW_LINK1_DISTACKPI_RCM_DA23_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA23_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA24_Pos      _U_(24)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA24_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA24_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA24(value)   (SPW_LINK1_DISTACKPI_RCM_DA24_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA24_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA25_Pos      _U_(25)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA25_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA25_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA25(value)   (SPW_LINK1_DISTACKPI_RCM_DA25_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA25_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA26_Pos      _U_(26)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA26_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA26_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA26(value)   (SPW_LINK1_DISTACKPI_RCM_DA26_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA26_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA27_Pos      _U_(27)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA27_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA27_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA27(value)   (SPW_LINK1_DISTACKPI_RCM_DA27_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA27_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA28_Pos      _U_(28)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA28_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA28_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA28(value)   (SPW_LINK1_DISTACKPI_RCM_DA28_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA28_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA29_Pos      _U_(29)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA29_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA29_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA29(value)   (SPW_LINK1_DISTACKPI_RCM_DA29_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA29_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA30_Pos      _U_(30)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA30_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA30_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA30(value)   (SPW_LINK1_DISTACKPI_RCM_DA30_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA30_Pos))
#define SPW_LINK1_DISTACKPI_RCM_DA31_Pos      _U_(31)                                              /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK1_DISTACKPI_RCM_DA31_Msk      (_U_(0x1) << SPW_LINK1_DISTACKPI_RCM_DA31_Pos)       /**< (SPW_LINK1_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK1_DISTACKPI_RCM_DA31(value)   (SPW_LINK1_DISTACKPI_RCM_DA31_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA31_Pos))
#define SPW_LINK1_DISTACKPI_RCM_Msk           _U_(0xFFFFFFFF)                                      /**< (SPW_LINK1_DISTACKPI_RCM) Register Mask  */

#define SPW_LINK1_DISTACKPI_RCM_DA_Pos        _U_(0)                                               /**< (SPW_LINK1_DISTACKPI_RCM Position) Distributed Acknowledge */
#define SPW_LINK1_DISTACKPI_RCM_DA_Msk        (_U_(0xFFFFFFFF) << SPW_LINK1_DISTACKPI_RCM_DA_Pos)  /**< (SPW_LINK1_DISTACKPI_RCM Mask) DA */
#define SPW_LINK1_DISTACKPI_RCM_DA(value)     (SPW_LINK1_DISTACKPI_RCM_DA_Msk & ((value) << SPW_LINK1_DISTACKPI_RCM_DA_Pos)) 

