Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/spw.h
#define SPW_LINK1_DISTACKIM_C_DA_Pos          _U_(0)                                               /**< (SPW_LINK1_DISTACKIM_C Position) Distributed Acknowledge mask */
#define SPW_LINK1_DISTACKIM_C_DA_Msk          (_U_(0xFFFFFFFF) << SPW_LINK1_DISTACKIM_C_DA_Pos)    /**< (SPW_LINK1_DISTACKIM_C Mask) DA */
#define SPW_LINK1_DISTACKIM_C_DA(value)       (SPW_LINK1_DISTACKIM_C_DA_Msk & ((value) << SPW_LINK1_DISTACKIM_C_DA_Pos)) 

/* -------- SPW_LINK2_PI_RM : (SPW Offset: 0x480) ( R/ 32) SpW Link 2 Pending Read Masked Interrupt -------- */
#define SPW_LINK2_PI_RM_DISERR_Pos            _U_(0)                                               /**< (SPW_LINK2_PI_RM) DisErr Position */
#define SPW_LINK2_PI_RM_DISERR_Msk            (_U_(0x1) << SPW_LINK2_PI_RM_DISERR_Pos)             /**< (SPW_LINK2_PI_RM) DisErr Mask */
#define SPW_LINK2_PI_RM_DISERR(value)         (SPW_LINK2_PI_RM_DISERR_Msk & ((value) << SPW_LINK2_PI_RM_DISERR_Pos))
#define SPW_LINK2_PI_RM_PARERR_Pos            _U_(1)                                               /**< (SPW_LINK2_PI_RM) ParErr Position */
#define SPW_LINK2_PI_RM_PARERR_Msk            (_U_(0x1) << SPW_LINK2_PI_RM_PARERR_Pos)             /**< (SPW_LINK2_PI_RM) ParErr Mask */
#define SPW_LINK2_PI_RM_PARERR(value)         (SPW_LINK2_PI_RM_PARERR_Msk & ((value) << SPW_LINK2_PI_RM_PARERR_Pos))
#define SPW_LINK2_PI_RM_ESCERR_Pos            _U_(2)                                               /**< (SPW_LINK2_PI_RM) ESCErr Position */
#define SPW_LINK2_PI_RM_ESCERR_Msk            (_U_(0x1) << SPW_LINK2_PI_RM_ESCERR_Pos)             /**< (SPW_LINK2_PI_RM) ESCErr Mask */
#define SPW_LINK2_PI_RM_ESCERR(value)         (SPW_LINK2_PI_RM_ESCERR_Msk & ((value) << SPW_LINK2_PI_RM_ESCERR_Pos))
#define SPW_LINK2_PI_RM_CRERR_Pos             _U_(3)                                               /**< (SPW_LINK2_PI_RM) CrErr Position */
#define SPW_LINK2_PI_RM_CRERR_Msk             (_U_(0x1) << SPW_LINK2_PI_RM_CRERR_Pos)              /**< (SPW_LINK2_PI_RM) CrErr Mask */
#define SPW_LINK2_PI_RM_CRERR(value)          (SPW_LINK2_PI_RM_CRERR_Msk & ((value) << SPW_LINK2_PI_RM_CRERR_Pos))
#define SPW_LINK2_PI_RM_LINKABORT_Pos         _U_(4)                                               /**< (SPW_LINK2_PI_RM) LinkAbort Position */
#define SPW_LINK2_PI_RM_LINKABORT_Msk         (_U_(0x1) << SPW_LINK2_PI_RM_LINKABORT_Pos)          /**< (SPW_LINK2_PI_RM) LinkAbort Mask */
#define SPW_LINK2_PI_RM_LINKABORT(value)      (SPW_LINK2_PI_RM_LINKABORT_Msk & ((value) << SPW_LINK2_PI_RM_LINKABORT_Pos))
#define SPW_LINK2_PI_RM_EEPTRANS_Pos          _U_(5)                                               /**< (SPW_LINK2_PI_RM) EEP transmitted Position */
#define SPW_LINK2_PI_RM_EEPTRANS_Msk          (_U_(0x1) << SPW_LINK2_PI_RM_EEPTRANS_Pos)           /**< (SPW_LINK2_PI_RM) EEP transmitted Mask */
#define SPW_LINK2_PI_RM_EEPTRANS(value)       (SPW_LINK2_PI_RM_EEPTRANS_Msk & ((value) << SPW_LINK2_PI_RM_EEPTRANS_Pos))
#define SPW_LINK2_PI_RM_EEPREC_Pos            _U_(6)                                               /**< (SPW_LINK2_PI_RM) EEP received Position */
#define SPW_LINK2_PI_RM_EEPREC_Msk            (_U_(0x1) << SPW_LINK2_PI_RM_EEPREC_Pos)             /**< (SPW_LINK2_PI_RM) EEP received Mask */
#define SPW_LINK2_PI_RM_EEPREC(value)         (SPW_LINK2_PI_RM_EEPREC_Msk & ((value) << SPW_LINK2_PI_RM_EEPREC_Pos))
#define SPW_LINK2_PI_RM_DISCARD_Pos           _U_(7)                                               /**< (SPW_LINK2_PI_RM) Discard Position */
#define SPW_LINK2_PI_RM_DISCARD_Msk           (_U_(0x1) << SPW_LINK2_PI_RM_DISCARD_Pos)            /**< (SPW_LINK2_PI_RM) Discard Mask */
#define SPW_LINK2_PI_RM_DISCARD(value)        (SPW_LINK2_PI_RM_DISCARD_Msk & ((value) << SPW_LINK2_PI_RM_DISCARD_Pos))
#define SPW_LINK2_PI_RM_ESCEVENT2_Pos         _U_(8)                                               /**< (SPW_LINK2_PI_RM) Escape Event 2 Position */
#define SPW_LINK2_PI_RM_ESCEVENT2_Msk         (_U_(0x1) << SPW_LINK2_PI_RM_ESCEVENT2_Pos)          /**< (SPW_LINK2_PI_RM) Escape Event 2 Mask */
#define SPW_LINK2_PI_RM_ESCEVENT2(value)      (SPW_LINK2_PI_RM_ESCEVENT2_Msk & ((value) << SPW_LINK2_PI_RM_ESCEVENT2_Pos))
#define SPW_LINK2_PI_RM_ESCEVENT1_Pos         _U_(9)                                               /**< (SPW_LINK2_PI_RM) Escape Event 1 Position */
#define SPW_LINK2_PI_RM_ESCEVENT1_Msk         (_U_(0x1) << SPW_LINK2_PI_RM_ESCEVENT1_Pos)          /**< (SPW_LINK2_PI_RM) Escape Event 1 Mask */
#define SPW_LINK2_PI_RM_ESCEVENT1(value)      (SPW_LINK2_PI_RM_ESCEVENT1_Msk & ((value) << SPW_LINK2_PI_RM_ESCEVENT1_Pos))
#define SPW_LINK2_PI_RM_Msk                   _U_(0x000003FF)                                      /**< (SPW_LINK2_PI_RM) Register Mask  */

#define SPW_LINK2_PI_RM_ESCEVENT_Pos          _U_(8)                                               /**< (SPW_LINK2_PI_RM Position) Escape Event x */
#define SPW_LINK2_PI_RM_ESCEVENT_Msk          (_U_(0x3) << SPW_LINK2_PI_RM_ESCEVENT_Pos)           /**< (SPW_LINK2_PI_RM Mask) ESCEVENT */
#define SPW_LINK2_PI_RM_ESCEVENT(value)       (SPW_LINK2_PI_RM_ESCEVENT_Msk & ((value) << SPW_LINK2_PI_RM_ESCEVENT_Pos)) 

/* -------- SPW_LINK2_PI_RCM : (SPW Offset: 0x484) ( R/ 32) SpW Link 2 Pending Read and Clear Masked Interrupt -------- */
#define SPW_LINK2_PI_RCM_DISERR_Pos           _U_(0)                                               /**< (SPW_LINK2_PI_RCM) DisErr Position */
#define SPW_LINK2_PI_RCM_DISERR_Msk           (_U_(0x1) << SPW_LINK2_PI_RCM_DISERR_Pos)            /**< (SPW_LINK2_PI_RCM) DisErr Mask */
#define SPW_LINK2_PI_RCM_DISERR(value)        (SPW_LINK2_PI_RCM_DISERR_Msk & ((value) << SPW_LINK2_PI_RCM_DISERR_Pos))
#define SPW_LINK2_PI_RCM_PARERR_Pos           _U_(1)                                               /**< (SPW_LINK2_PI_RCM) ParErr Position */
#define SPW_LINK2_PI_RCM_PARERR_Msk           (_U_(0x1) << SPW_LINK2_PI_RCM_PARERR_Pos)            /**< (SPW_LINK2_PI_RCM) ParErr Mask */
#define SPW_LINK2_PI_RCM_PARERR(value)        (SPW_LINK2_PI_RCM_PARERR_Msk & ((value) << SPW_LINK2_PI_RCM_PARERR_Pos))
#define SPW_LINK2_PI_RCM_ESCERR_Pos           _U_(2)                                               /**< (SPW_LINK2_PI_RCM) ESCErr Position */
#define SPW_LINK2_PI_RCM_ESCERR_Msk           (_U_(0x1) << SPW_LINK2_PI_RCM_ESCERR_Pos)            /**< (SPW_LINK2_PI_RCM) ESCErr Mask */
#define SPW_LINK2_PI_RCM_ESCERR(value)        (SPW_LINK2_PI_RCM_ESCERR_Msk & ((value) << SPW_LINK2_PI_RCM_ESCERR_Pos))
#define SPW_LINK2_PI_RCM_CRERR_Pos            _U_(3)                                               /**< (SPW_LINK2_PI_RCM) CrErr Position */
#define SPW_LINK2_PI_RCM_CRERR_Msk            (_U_(0x1) << SPW_LINK2_PI_RCM_CRERR_Pos)             /**< (SPW_LINK2_PI_RCM) CrErr Mask */
#define SPW_LINK2_PI_RCM_CRERR(value)         (SPW_LINK2_PI_RCM_CRERR_Msk & ((value) << SPW_LINK2_PI_RCM_CRERR_Pos))
#define SPW_LINK2_PI_RCM_LINKABORT_Pos        _U_(4)                                               /**< (SPW_LINK2_PI_RCM) LinkAbort Position */
#define SPW_LINK2_PI_RCM_LINKABORT_Msk        (_U_(0x1) << SPW_LINK2_PI_RCM_LINKABORT_Pos)         /**< (SPW_LINK2_PI_RCM) LinkAbort Mask */
#define SPW_LINK2_PI_RCM_LINKABORT(value)     (SPW_LINK2_PI_RCM_LINKABORT_Msk & ((value) << SPW_LINK2_PI_RCM_LINKABORT_Pos))
#define SPW_LINK2_PI_RCM_EEPTRANS_Pos         _U_(5)                                               /**< (SPW_LINK2_PI_RCM) EEP transmitted Position */
#define SPW_LINK2_PI_RCM_EEPTRANS_Msk         (_U_(0x1) << SPW_LINK2_PI_RCM_EEPTRANS_Pos)          /**< (SPW_LINK2_PI_RCM) EEP transmitted Mask */
#define SPW_LINK2_PI_RCM_EEPTRANS(value)      (SPW_LINK2_PI_RCM_EEPTRANS_Msk & ((value) << SPW_LINK2_PI_RCM_EEPTRANS_Pos))
#define SPW_LINK2_PI_RCM_EEPREC_Pos           _U_(6)                                               /**< (SPW_LINK2_PI_RCM) EEP received Position */
#define SPW_LINK2_PI_RCM_EEPREC_Msk           (_U_(0x1) << SPW_LINK2_PI_RCM_EEPREC_Pos)            /**< (SPW_LINK2_PI_RCM) EEP received Mask */
#define SPW_LINK2_PI_RCM_EEPREC(value)        (SPW_LINK2_PI_RCM_EEPREC_Msk & ((value) << SPW_LINK2_PI_RCM_EEPREC_Pos))
#define SPW_LINK2_PI_RCM_DISCARD_Pos          _U_(7)                                               /**< (SPW_LINK2_PI_RCM) Discard Position */
#define SPW_LINK2_PI_RCM_DISCARD_Msk          (_U_(0x1) << SPW_LINK2_PI_RCM_DISCARD_Pos)           /**< (SPW_LINK2_PI_RCM) Discard Mask */
#define SPW_LINK2_PI_RCM_DISCARD(value)       (SPW_LINK2_PI_RCM_DISCARD_Msk & ((value) << SPW_LINK2_PI_RCM_DISCARD_Pos))
#define SPW_LINK2_PI_RCM_ESCEVENT2_Pos        _U_(8)                                               /**< (SPW_LINK2_PI_RCM) Escape Event 2 Position */
#define SPW_LINK2_PI_RCM_ESCEVENT2_Msk        (_U_(0x1) << SPW_LINK2_PI_RCM_ESCEVENT2_Pos)         /**< (SPW_LINK2_PI_RCM) Escape Event 2 Mask */
#define SPW_LINK2_PI_RCM_ESCEVENT2(value)     (SPW_LINK2_PI_RCM_ESCEVENT2_Msk & ((value) << SPW_LINK2_PI_RCM_ESCEVENT2_Pos))
#define SPW_LINK2_PI_RCM_ESCEVENT1_Pos        _U_(9)                                               /**< (SPW_LINK2_PI_RCM) Escape Event 1 Position */
#define SPW_LINK2_PI_RCM_ESCEVENT1_Msk        (_U_(0x1) << SPW_LINK2_PI_RCM_ESCEVENT1_Pos)         /**< (SPW_LINK2_PI_RCM) Escape Event 1 Mask */
#define SPW_LINK2_PI_RCM_ESCEVENT1(value)     (SPW_LINK2_PI_RCM_ESCEVENT1_Msk & ((value) << SPW_LINK2_PI_RCM_ESCEVENT1_Pos))
#define SPW_LINK2_PI_RCM_Msk                  _U_(0x000003FF)                                      /**< (SPW_LINK2_PI_RCM) Register Mask  */

#define SPW_LINK2_PI_RCM_ESCEVENT_Pos         _U_(8)                                               /**< (SPW_LINK2_PI_RCM Position) Escape Event x */
#define SPW_LINK2_PI_RCM_ESCEVENT_Msk         (_U_(0x3) << SPW_LINK2_PI_RCM_ESCEVENT_Pos)          /**< (SPW_LINK2_PI_RCM Mask) ESCEVENT */
#define SPW_LINK2_PI_RCM_ESCEVENT(value)      (SPW_LINK2_PI_RCM_ESCEVENT_Msk & ((value) << SPW_LINK2_PI_RCM_ESCEVENT_Pos)) 

/* -------- SPW_LINK2_PI_R : (SPW Offset: 0x488) ( R/ 32) SpW Link 2 Pending Read Interrupt -------- */
#define SPW_LINK2_PI_R_DISERR_Pos             _U_(0)                                               /**< (SPW_LINK2_PI_R) DisErr Position */
#define SPW_LINK2_PI_R_DISERR_Msk             (_U_(0x1) << SPW_LINK2_PI_R_DISERR_Pos)              /**< (SPW_LINK2_PI_R) DisErr Mask */
#define SPW_LINK2_PI_R_DISERR(value)          (SPW_LINK2_PI_R_DISERR_Msk & ((value) << SPW_LINK2_PI_R_DISERR_Pos))
#define SPW_LINK2_PI_R_PARERR_Pos             _U_(1)                                               /**< (SPW_LINK2_PI_R) ParErr Position */
#define SPW_LINK2_PI_R_PARERR_Msk             (_U_(0x1) << SPW_LINK2_PI_R_PARERR_Pos)              /**< (SPW_LINK2_PI_R) ParErr Mask */
#define SPW_LINK2_PI_R_PARERR(value)          (SPW_LINK2_PI_R_PARERR_Msk & ((value) << SPW_LINK2_PI_R_PARERR_Pos))
#define SPW_LINK2_PI_R_ESCERR_Pos             _U_(2)                                               /**< (SPW_LINK2_PI_R) ESCErr Position */
#define SPW_LINK2_PI_R_ESCERR_Msk             (_U_(0x1) << SPW_LINK2_PI_R_ESCERR_Pos)              /**< (SPW_LINK2_PI_R) ESCErr Mask */
#define SPW_LINK2_PI_R_ESCERR(value)          (SPW_LINK2_PI_R_ESCERR_Msk & ((value) << SPW_LINK2_PI_R_ESCERR_Pos))
#define SPW_LINK2_PI_R_CRERR_Pos              _U_(3)                                               /**< (SPW_LINK2_PI_R) CrErr Position */
#define SPW_LINK2_PI_R_CRERR_Msk              (_U_(0x1) << SPW_LINK2_PI_R_CRERR_Pos)               /**< (SPW_LINK2_PI_R) CrErr Mask */
#define SPW_LINK2_PI_R_CRERR(value)           (SPW_LINK2_PI_R_CRERR_Msk & ((value) << SPW_LINK2_PI_R_CRERR_Pos))
#define SPW_LINK2_PI_R_LINKABORT_Pos          _U_(4)                                               /**< (SPW_LINK2_PI_R) LinkAbort Position */
#define SPW_LINK2_PI_R_LINKABORT_Msk          (_U_(0x1) << SPW_LINK2_PI_R_LINKABORT_Pos)           /**< (SPW_LINK2_PI_R) LinkAbort Mask */
#define SPW_LINK2_PI_R_LINKABORT(value)       (SPW_LINK2_PI_R_LINKABORT_Msk & ((value) << SPW_LINK2_PI_R_LINKABORT_Pos))
#define SPW_LINK2_PI_R_EEPTRANS_Pos           _U_(5)                                               /**< (SPW_LINK2_PI_R) EEP transmitted Position */
#define SPW_LINK2_PI_R_EEPTRANS_Msk           (_U_(0x1) << SPW_LINK2_PI_R_EEPTRANS_Pos)            /**< (SPW_LINK2_PI_R) EEP transmitted Mask */
#define SPW_LINK2_PI_R_EEPTRANS(value)        (SPW_LINK2_PI_R_EEPTRANS_Msk & ((value) << SPW_LINK2_PI_R_EEPTRANS_Pos))
#define SPW_LINK2_PI_R_EEPREC_Pos             _U_(6)                                               /**< (SPW_LINK2_PI_R) EEP received Position */
#define SPW_LINK2_PI_R_EEPREC_Msk             (_U_(0x1) << SPW_LINK2_PI_R_EEPREC_Pos)              /**< (SPW_LINK2_PI_R) EEP received Mask */
#define SPW_LINK2_PI_R_EEPREC(value)          (SPW_LINK2_PI_R_EEPREC_Msk & ((value) << SPW_LINK2_PI_R_EEPREC_Pos))
#define SPW_LINK2_PI_R_DISCARD_Pos            _U_(7)                                               /**< (SPW_LINK2_PI_R) Discard Position */
#define SPW_LINK2_PI_R_DISCARD_Msk            (_U_(0x1) << SPW_LINK2_PI_R_DISCARD_Pos)             /**< (SPW_LINK2_PI_R) Discard Mask */
#define SPW_LINK2_PI_R_DISCARD(value)         (SPW_LINK2_PI_R_DISCARD_Msk & ((value) << SPW_LINK2_PI_R_DISCARD_Pos))
#define SPW_LINK2_PI_R_ESCEVENT2_Pos          _U_(8)                                               /**< (SPW_LINK2_PI_R) Escape Event 2 Position */
#define SPW_LINK2_PI_R_ESCEVENT2_Msk          (_U_(0x1) << SPW_LINK2_PI_R_ESCEVENT2_Pos)           /**< (SPW_LINK2_PI_R) Escape Event 2 Mask */
#define SPW_LINK2_PI_R_ESCEVENT2(value)       (SPW_LINK2_PI_R_ESCEVENT2_Msk & ((value) << SPW_LINK2_PI_R_ESCEVENT2_Pos))
#define SPW_LINK2_PI_R_ESCEVENT1_Pos          _U_(9)                                               /**< (SPW_LINK2_PI_R) Escape Event 1 Position */
#define SPW_LINK2_PI_R_ESCEVENT1_Msk          (_U_(0x1) << SPW_LINK2_PI_R_ESCEVENT1_Pos)           /**< (SPW_LINK2_PI_R) Escape Event 1 Mask */
#define SPW_LINK2_PI_R_ESCEVENT1(value)       (SPW_LINK2_PI_R_ESCEVENT1_Msk & ((value) << SPW_LINK2_PI_R_ESCEVENT1_Pos))
#define SPW_LINK2_PI_R_Msk                    _U_(0x000003FF)                                      /**< (SPW_LINK2_PI_R) Register Mask  */

