Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/spw.h
/* -------- SPW_LINK2_DISTINTPI_RCM : (SPW Offset: 0x4C4) ( R/ 32) SpW Link 2 Distributed Interrupt Pending Read and Clear Masked Interrupt -------- */
#define SPW_LINK2_DISTINTPI_RCM_DI0_Pos       _U_(0)                                               /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI0_Msk       (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI0_Pos)        /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI0(value)    (SPW_LINK2_DISTINTPI_RCM_DI0_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI0_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI1_Pos       _U_(1)                                               /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI1_Msk       (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI1_Pos)        /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI1(value)    (SPW_LINK2_DISTINTPI_RCM_DI1_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI1_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI2_Pos       _U_(2)                                               /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI2_Msk       (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI2_Pos)        /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI2(value)    (SPW_LINK2_DISTINTPI_RCM_DI2_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI2_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI3_Pos       _U_(3)                                               /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI3_Msk       (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI3_Pos)        /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI3(value)    (SPW_LINK2_DISTINTPI_RCM_DI3_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI3_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI4_Pos       _U_(4)                                               /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI4_Msk       (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI4_Pos)        /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI4(value)    (SPW_LINK2_DISTINTPI_RCM_DI4_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI4_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI5_Pos       _U_(5)                                               /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI5_Msk       (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI5_Pos)        /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI5(value)    (SPW_LINK2_DISTINTPI_RCM_DI5_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI5_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI6_Pos       _U_(6)                                               /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI6_Msk       (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI6_Pos)        /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI6(value)    (SPW_LINK2_DISTINTPI_RCM_DI6_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI6_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI7_Pos       _U_(7)                                               /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI7_Msk       (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI7_Pos)        /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI7(value)    (SPW_LINK2_DISTINTPI_RCM_DI7_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI7_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI8_Pos       _U_(8)                                               /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI8_Msk       (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI8_Pos)        /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI8(value)    (SPW_LINK2_DISTINTPI_RCM_DI8_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI8_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI9_Pos       _U_(9)                                               /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI9_Msk       (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI9_Pos)        /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI9(value)    (SPW_LINK2_DISTINTPI_RCM_DI9_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI9_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI10_Pos      _U_(10)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI10_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI10_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI10(value)   (SPW_LINK2_DISTINTPI_RCM_DI10_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI10_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI11_Pos      _U_(11)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI11_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI11_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI11(value)   (SPW_LINK2_DISTINTPI_RCM_DI11_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI11_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI12_Pos      _U_(12)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI12_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI12_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI12(value)   (SPW_LINK2_DISTINTPI_RCM_DI12_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI12_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI13_Pos      _U_(13)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI13_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI13_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI13(value)   (SPW_LINK2_DISTINTPI_RCM_DI13_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI13_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI14_Pos      _U_(14)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI14_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI14_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI14(value)   (SPW_LINK2_DISTINTPI_RCM_DI14_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI14_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI15_Pos      _U_(15)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI15_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI15_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI15(value)   (SPW_LINK2_DISTINTPI_RCM_DI15_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI15_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI16_Pos      _U_(16)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI16_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI16_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI16(value)   (SPW_LINK2_DISTINTPI_RCM_DI16_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI16_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI17_Pos      _U_(17)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI17_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI17_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI17(value)   (SPW_LINK2_DISTINTPI_RCM_DI17_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI17_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI18_Pos      _U_(18)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI18_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI18_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI18(value)   (SPW_LINK2_DISTINTPI_RCM_DI18_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI18_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI19_Pos      _U_(19)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI19_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI19_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI19(value)   (SPW_LINK2_DISTINTPI_RCM_DI19_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI19_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI20_Pos      _U_(20)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI20_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI20_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI20(value)   (SPW_LINK2_DISTINTPI_RCM_DI20_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI20_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI21_Pos      _U_(21)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI21_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI21_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI21(value)   (SPW_LINK2_DISTINTPI_RCM_DI21_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI21_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI22_Pos      _U_(22)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI22_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI22_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI22(value)   (SPW_LINK2_DISTINTPI_RCM_DI22_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI22_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI23_Pos      _U_(23)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI23_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI23_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI23(value)   (SPW_LINK2_DISTINTPI_RCM_DI23_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI23_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI24_Pos      _U_(24)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI24_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI24_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI24(value)   (SPW_LINK2_DISTINTPI_RCM_DI24_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI24_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI25_Pos      _U_(25)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI25_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI25_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI25(value)   (SPW_LINK2_DISTINTPI_RCM_DI25_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI25_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI26_Pos      _U_(26)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI26_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI26_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI26(value)   (SPW_LINK2_DISTINTPI_RCM_DI26_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI26_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI27_Pos      _U_(27)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI27_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI27_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI27(value)   (SPW_LINK2_DISTINTPI_RCM_DI27_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI27_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI28_Pos      _U_(28)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI28_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI28_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI28(value)   (SPW_LINK2_DISTINTPI_RCM_DI28_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI28_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI29_Pos      _U_(29)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI29_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI29_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI29(value)   (SPW_LINK2_DISTINTPI_RCM_DI29_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI29_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI30_Pos      _U_(30)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI30_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI30_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI30(value)   (SPW_LINK2_DISTINTPI_RCM_DI30_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI30_Pos))
#define SPW_LINK2_DISTINTPI_RCM_DI31_Pos      _U_(31)                                              /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Position */
#define SPW_LINK2_DISTINTPI_RCM_DI31_Msk      (_U_(0x1) << SPW_LINK2_DISTINTPI_RCM_DI31_Pos)       /**< (SPW_LINK2_DISTINTPI_RCM) Distributed Interrupt Mask */
#define SPW_LINK2_DISTINTPI_RCM_DI31(value)   (SPW_LINK2_DISTINTPI_RCM_DI31_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI31_Pos))
#define SPW_LINK2_DISTINTPI_RCM_Msk           _U_(0xFFFFFFFF)                                      /**< (SPW_LINK2_DISTINTPI_RCM) Register Mask  */

#define SPW_LINK2_DISTINTPI_RCM_DI_Pos        _U_(0)                                               /**< (SPW_LINK2_DISTINTPI_RCM Position) Distributed Interrupt */
#define SPW_LINK2_DISTINTPI_RCM_DI_Msk        (_U_(0xFFFFFFFF) << SPW_LINK2_DISTINTPI_RCM_DI_Pos)  /**< (SPW_LINK2_DISTINTPI_RCM Mask) DI */
#define SPW_LINK2_DISTINTPI_RCM_DI(value)     (SPW_LINK2_DISTINTPI_RCM_DI_Msk & ((value) << SPW_LINK2_DISTINTPI_RCM_DI_Pos)) 

