Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/spw.h
/* -------- SPW_PKTRX1_PI_C : (SPW Offset: 0x814) ( /W 32) PktRx Clear Pending Interrupt -------- */
#define SPW_PKTRX1_PI_C_DEACT_Pos             _U_(0)                                               /**< (SPW_PKTRX1_PI_C) Deactivated Position */
#define SPW_PKTRX1_PI_C_DEACT_Msk             (_U_(0x1) << SPW_PKTRX1_PI_C_DEACT_Pos)              /**< (SPW_PKTRX1_PI_C) Deactivated Mask */
#define SPW_PKTRX1_PI_C_DEACT(value)          (SPW_PKTRX1_PI_C_DEACT_Msk & ((value) << SPW_PKTRX1_PI_C_DEACT_Pos))
#define SPW_PKTRX1_PI_C_EOP_Pos               _U_(1)                                               /**< (SPW_PKTRX1_PI_C) EOP seen Position */
#define SPW_PKTRX1_PI_C_EOP_Msk               (_U_(0x1) << SPW_PKTRX1_PI_C_EOP_Pos)                /**< (SPW_PKTRX1_PI_C) EOP seen Mask */
#define SPW_PKTRX1_PI_C_EOP(value)            (SPW_PKTRX1_PI_C_EOP_Msk & ((value) << SPW_PKTRX1_PI_C_EOP_Pos))
#define SPW_PKTRX1_PI_C_EEP_Pos               _U_(2)                                               /**< (SPW_PKTRX1_PI_C) EEP seen Position */
#define SPW_PKTRX1_PI_C_EEP_Msk               (_U_(0x1) << SPW_PKTRX1_PI_C_EEP_Pos)                /**< (SPW_PKTRX1_PI_C) EEP seen Mask */
#define SPW_PKTRX1_PI_C_EEP(value)            (SPW_PKTRX1_PI_C_EEP_Msk & ((value) << SPW_PKTRX1_PI_C_EEP_Pos))
#define SPW_PKTRX1_PI_C_DISCARD_Pos           _U_(3)                                               /**< (SPW_PKTRX1_PI_C) Packet Discard Position */
#define SPW_PKTRX1_PI_C_DISCARD_Msk           (_U_(0x1) << SPW_PKTRX1_PI_C_DISCARD_Pos)            /**< (SPW_PKTRX1_PI_C) Packet Discard Mask */
#define SPW_PKTRX1_PI_C_DISCARD(value)        (SPW_PKTRX1_PI_C_DISCARD_Msk & ((value) << SPW_PKTRX1_PI_C_DISCARD_Pos))
#define SPW_PKTRX1_PI_C_ACT_Pos               _U_(4)                                               /**< (SPW_PKTRX1_PI_C) Activated Position */
#define SPW_PKTRX1_PI_C_ACT_Msk               (_U_(0x1) << SPW_PKTRX1_PI_C_ACT_Pos)                /**< (SPW_PKTRX1_PI_C) Activated Mask */
#define SPW_PKTRX1_PI_C_ACT(value)            (SPW_PKTRX1_PI_C_ACT_Msk & ((value) << SPW_PKTRX1_PI_C_ACT_Pos))
#define SPW_PKTRX1_PI_C_Msk                   _U_(0x0000001F)                                      /**< (SPW_PKTRX1_PI_C) Register Mask  */


/* -------- SPW_PKTRX1_IM_S : (SPW Offset: 0x818) ( /W 32) PktRx Interrupt Set Mask -------- */
#define SPW_PKTRX1_IM_S_DEACT_Pos             _U_(0)                                               /**< (SPW_PKTRX1_IM_S) Deactivated Position */
#define SPW_PKTRX1_IM_S_DEACT_Msk             (_U_(0x1) << SPW_PKTRX1_IM_S_DEACT_Pos)              /**< (SPW_PKTRX1_IM_S) Deactivated Mask */
#define SPW_PKTRX1_IM_S_DEACT(value)          (SPW_PKTRX1_IM_S_DEACT_Msk & ((value) << SPW_PKTRX1_IM_S_DEACT_Pos))
#define SPW_PKTRX1_IM_S_EOP_Pos               _U_(1)                                               /**< (SPW_PKTRX1_IM_S) EOP seen Position */
#define SPW_PKTRX1_IM_S_EOP_Msk               (_U_(0x1) << SPW_PKTRX1_IM_S_EOP_Pos)                /**< (SPW_PKTRX1_IM_S) EOP seen Mask */
#define SPW_PKTRX1_IM_S_EOP(value)            (SPW_PKTRX1_IM_S_EOP_Msk & ((value) << SPW_PKTRX1_IM_S_EOP_Pos))
#define SPW_PKTRX1_IM_S_EEP_Pos               _U_(2)                                               /**< (SPW_PKTRX1_IM_S) EEP seen Position */
#define SPW_PKTRX1_IM_S_EEP_Msk               (_U_(0x1) << SPW_PKTRX1_IM_S_EEP_Pos)                /**< (SPW_PKTRX1_IM_S) EEP seen Mask */
#define SPW_PKTRX1_IM_S_EEP(value)            (SPW_PKTRX1_IM_S_EEP_Msk & ((value) << SPW_PKTRX1_IM_S_EEP_Pos))
#define SPW_PKTRX1_IM_S_DISCARD_Pos           _U_(3)                                               /**< (SPW_PKTRX1_IM_S) Packet Discard Position */
#define SPW_PKTRX1_IM_S_DISCARD_Msk           (_U_(0x1) << SPW_PKTRX1_IM_S_DISCARD_Pos)            /**< (SPW_PKTRX1_IM_S) Packet Discard Mask */
#define SPW_PKTRX1_IM_S_DISCARD(value)        (SPW_PKTRX1_IM_S_DISCARD_Msk & ((value) << SPW_PKTRX1_IM_S_DISCARD_Pos))
#define SPW_PKTRX1_IM_S_ACT_Pos               _U_(4)                                               /**< (SPW_PKTRX1_IM_S) Activated Position */
#define SPW_PKTRX1_IM_S_ACT_Msk               (_U_(0x1) << SPW_PKTRX1_IM_S_ACT_Pos)                /**< (SPW_PKTRX1_IM_S) Activated Mask */
#define SPW_PKTRX1_IM_S_ACT(value)            (SPW_PKTRX1_IM_S_ACT_Msk & ((value) << SPW_PKTRX1_IM_S_ACT_Pos))
#define SPW_PKTRX1_IM_S_Msk                   _U_(0x0000001F)                                      /**< (SPW_PKTRX1_IM_S) Register Mask  */


/* -------- SPW_PKTRX1_IM_C : (SPW Offset: 0x81C) ( /W 32) PktRx Interrupt Clear Mask -------- */
#define SPW_PKTRX1_IM_C_DEACT_Pos             _U_(0)                                               /**< (SPW_PKTRX1_IM_C) Deactivated Position */
#define SPW_PKTRX1_IM_C_DEACT_Msk             (_U_(0x1) << SPW_PKTRX1_IM_C_DEACT_Pos)              /**< (SPW_PKTRX1_IM_C) Deactivated Mask */
#define SPW_PKTRX1_IM_C_DEACT(value)          (SPW_PKTRX1_IM_C_DEACT_Msk & ((value) << SPW_PKTRX1_IM_C_DEACT_Pos))
#define SPW_PKTRX1_IM_C_EOP_Pos               _U_(1)                                               /**< (SPW_PKTRX1_IM_C) EOP seen Position */
#define SPW_PKTRX1_IM_C_EOP_Msk               (_U_(0x1) << SPW_PKTRX1_IM_C_EOP_Pos)                /**< (SPW_PKTRX1_IM_C) EOP seen Mask */
#define SPW_PKTRX1_IM_C_EOP(value)            (SPW_PKTRX1_IM_C_EOP_Msk & ((value) << SPW_PKTRX1_IM_C_EOP_Pos))
#define SPW_PKTRX1_IM_C_EEP_Pos               _U_(2)                                               /**< (SPW_PKTRX1_IM_C) EEP seen Position */
#define SPW_PKTRX1_IM_C_EEP_Msk               (_U_(0x1) << SPW_PKTRX1_IM_C_EEP_Pos)                /**< (SPW_PKTRX1_IM_C) EEP seen Mask */
#define SPW_PKTRX1_IM_C_EEP(value)            (SPW_PKTRX1_IM_C_EEP_Msk & ((value) << SPW_PKTRX1_IM_C_EEP_Pos))
#define SPW_PKTRX1_IM_C_DISCARD_Pos           _U_(3)                                               /**< (SPW_PKTRX1_IM_C) Packet Discard Position */
#define SPW_PKTRX1_IM_C_DISCARD_Msk           (_U_(0x1) << SPW_PKTRX1_IM_C_DISCARD_Pos)            /**< (SPW_PKTRX1_IM_C) Packet Discard Mask */
#define SPW_PKTRX1_IM_C_DISCARD(value)        (SPW_PKTRX1_IM_C_DISCARD_Msk & ((value) << SPW_PKTRX1_IM_C_DISCARD_Pos))
#define SPW_PKTRX1_IM_C_ACT_Pos               _U_(4)                                               /**< (SPW_PKTRX1_IM_C) Activated Position */
#define SPW_PKTRX1_IM_C_ACT_Msk               (_U_(0x1) << SPW_PKTRX1_IM_C_ACT_Pos)                /**< (SPW_PKTRX1_IM_C) Activated Mask */
#define SPW_PKTRX1_IM_C_ACT(value)            (SPW_PKTRX1_IM_C_ACT_Msk & ((value) << SPW_PKTRX1_IM_C_ACT_Pos))
#define SPW_PKTRX1_IM_C_Msk                   _U_(0x0000001F)                                      /**< (SPW_PKTRX1_IM_C) Register Mask  */


