Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/spw.h
/* -------- SPW_PKTRX1_CFG : (SPW Offset: 0x820) (R/W 32) PktRx Config -------- */
#define SPW_PKTRX1_CFG_DISCARD_Pos            _U_(0)                                               /**< (SPW_PKTRX1_CFG) Discard Position */
#define SPW_PKTRX1_CFG_DISCARD_Msk            (_U_(0x1) << SPW_PKTRX1_CFG_DISCARD_Pos)             /**< (SPW_PKTRX1_CFG) Discard Mask */
#define SPW_PKTRX1_CFG_DISCARD(value)         (SPW_PKTRX1_CFG_DISCARD_Msk & ((value) << SPW_PKTRX1_CFG_DISCARD_Pos))
#define SPW_PKTRX1_CFG_Msk                    _U_(0x00000001)                                      /**< (SPW_PKTRX1_CFG) Register Mask  */


/* -------- SPW_PKTRX1_STATUS : (SPW Offset: 0x824) ( R/ 32) PktRx Status -------- */
#define SPW_PKTRX1_STATUS_COUNT_Pos           _U_(0)                                               /**< (SPW_PKTRX1_STATUS) Packet Count Position */
#define SPW_PKTRX1_STATUS_COUNT_Msk           (_U_(0xFFFF) << SPW_PKTRX1_STATUS_COUNT_Pos)         /**< (SPW_PKTRX1_STATUS) Packet Count Mask */
#define SPW_PKTRX1_STATUS_COUNT(value)        (SPW_PKTRX1_STATUS_COUNT_Msk & ((value) << SPW_PKTRX1_STATUS_COUNT_Pos))
#define SPW_PKTRX1_STATUS_PACKET_Pos          _U_(16)                                              /**< (SPW_PKTRX1_STATUS) Packet Position */
#define SPW_PKTRX1_STATUS_PACKET_Msk          (_U_(0x1) << SPW_PKTRX1_STATUS_PACKET_Pos)           /**< (SPW_PKTRX1_STATUS) Packet Mask */
#define SPW_PKTRX1_STATUS_PACKET(value)       (SPW_PKTRX1_STATUS_PACKET_Msk & ((value) << SPW_PKTRX1_STATUS_PACKET_Pos))
#define SPW_PKTRX1_STATUS_LOCKED_Pos          _U_(17)                                              /**< (SPW_PKTRX1_STATUS) Locked Position */
#define SPW_PKTRX1_STATUS_LOCKED_Msk          (_U_(0x1) << SPW_PKTRX1_STATUS_LOCKED_Pos)           /**< (SPW_PKTRX1_STATUS) Locked Mask */
#define SPW_PKTRX1_STATUS_LOCKED(value)       (SPW_PKTRX1_STATUS_LOCKED_Msk & ((value) << SPW_PKTRX1_STATUS_LOCKED_Pos))
#define SPW_PKTRX1_STATUS_ARM_Pos             _U_(18)                                              /**< (SPW_PKTRX1_STATUS) Armed Position */
#define SPW_PKTRX1_STATUS_ARM_Msk             (_U_(0x1) << SPW_PKTRX1_STATUS_ARM_Pos)              /**< (SPW_PKTRX1_STATUS) Armed Mask */
#define SPW_PKTRX1_STATUS_ARM(value)          (SPW_PKTRX1_STATUS_ARM_Msk & ((value) << SPW_PKTRX1_STATUS_ARM_Pos))
#define SPW_PKTRX1_STATUS_ACT_Pos             _U_(19)                                              /**< (SPW_PKTRX1_STATUS) Active Position */
#define SPW_PKTRX1_STATUS_ACT_Msk             (_U_(0x1) << SPW_PKTRX1_STATUS_ACT_Pos)              /**< (SPW_PKTRX1_STATUS) Active Mask */
#define SPW_PKTRX1_STATUS_ACT(value)          (SPW_PKTRX1_STATUS_ACT_Msk & ((value) << SPW_PKTRX1_STATUS_ACT_Pos))
#define SPW_PKTRX1_STATUS_PENDING_Pos         _U_(20)                                              /**< (SPW_PKTRX1_STATUS) Pending Position */
#define SPW_PKTRX1_STATUS_PENDING_Msk         (_U_(0x1) << SPW_PKTRX1_STATUS_PENDING_Pos)          /**< (SPW_PKTRX1_STATUS) Pending Mask */
#define SPW_PKTRX1_STATUS_PENDING(value)      (SPW_PKTRX1_STATUS_PENDING_Msk & ((value) << SPW_PKTRX1_STATUS_PENDING_Pos))
#define SPW_PKTRX1_STATUS_DEACT_Pos           _U_(21)                                              /**< (SPW_PKTRX1_STATUS) Deactivating Position */
#define SPW_PKTRX1_STATUS_DEACT_Msk           (_U_(0x1) << SPW_PKTRX1_STATUS_DEACT_Pos)            /**< (SPW_PKTRX1_STATUS) Deactivating Mask */
#define SPW_PKTRX1_STATUS_DEACT(value)        (SPW_PKTRX1_STATUS_DEACT_Msk & ((value) << SPW_PKTRX1_STATUS_DEACT_Pos))
#define SPW_PKTRX1_STATUS_Msk                 _U_(0x003FFFFF)                                      /**< (SPW_PKTRX1_STATUS) Register Mask  */


/* -------- SPW_PKTRX1_NXTBUFDATAADDR : (SPW Offset: 0x830) (R/W 32) PktRx Next Buffer Data Address -------- */
#define SPW_PKTRX1_NXTBUFDATAADDR_ADDR_Pos    _U_(0)                                               /**< (SPW_PKTRX1_NXTBUFDATAADDR) Address Position */
#define SPW_PKTRX1_NXTBUFDATAADDR_ADDR_Msk    (_U_(0xFFFFFFFF) << SPW_PKTRX1_NXTBUFDATAADDR_ADDR_Pos) /**< (SPW_PKTRX1_NXTBUFDATAADDR) Address Mask */
#define SPW_PKTRX1_NXTBUFDATAADDR_ADDR(value) (SPW_PKTRX1_NXTBUFDATAADDR_ADDR_Msk & ((value) << SPW_PKTRX1_NXTBUFDATAADDR_ADDR_Pos))
#define SPW_PKTRX1_NXTBUFDATAADDR_Msk         _U_(0xFFFFFFFF)                                      /**< (SPW_PKTRX1_NXTBUFDATAADDR) Register Mask  */


/* -------- SPW_PKTRX1_NXTBUFDATALEN : (SPW Offset: 0x834) (R/W 32) PktRx Next Buffer Data Length -------- */
#define SPW_PKTRX1_NXTBUFDATALEN_LEN_Pos      _U_(0)                                               /**< (SPW_PKTRX1_NXTBUFDATALEN) Length Position */
#define SPW_PKTRX1_NXTBUFDATALEN_LEN_Msk      (_U_(0xFFFFFF) << SPW_PKTRX1_NXTBUFDATALEN_LEN_Pos)  /**< (SPW_PKTRX1_NXTBUFDATALEN) Length Mask */
#define SPW_PKTRX1_NXTBUFDATALEN_LEN(value)   (SPW_PKTRX1_NXTBUFDATALEN_LEN_Msk & ((value) << SPW_PKTRX1_NXTBUFDATALEN_LEN_Pos))
#define SPW_PKTRX1_NXTBUFDATALEN_Msk          _U_(0x00FFFFFF)                                      /**< (SPW_PKTRX1_NXTBUFDATALEN) Register Mask  */


/* -------- SPW_PKTRX1_NXTBUFPKTADDR : (SPW Offset: 0x838) (R/W 32) PktRx Next Buffer Packet Address -------- */
#define SPW_PKTRX1_NXTBUFPKTADDR_ADDR_Pos     _U_(0)                                               /**< (SPW_PKTRX1_NXTBUFPKTADDR) Address Position */
#define SPW_PKTRX1_NXTBUFPKTADDR_ADDR_Msk     (_U_(0xFFFFFFFF) << SPW_PKTRX1_NXTBUFPKTADDR_ADDR_Pos) /**< (SPW_PKTRX1_NXTBUFPKTADDR) Address Mask */
#define SPW_PKTRX1_NXTBUFPKTADDR_ADDR(value)  (SPW_PKTRX1_NXTBUFPKTADDR_ADDR_Msk & ((value) << SPW_PKTRX1_NXTBUFPKTADDR_ADDR_Pos))
#define SPW_PKTRX1_NXTBUFPKTADDR_Msk          _U_(0xFFFFFFFF)                                      /**< (SPW_PKTRX1_NXTBUFPKTADDR) Register Mask  */


/* -------- SPW_PKTRX1_NXTBUFCFG : (SPW Offset: 0x83C) (R/W 32) PktRx Next Buffer Config -------- */
#define SPW_PKTRX1_NXTBUFCFG_MAXCNT_Pos       _U_(0)                                               /**< (SPW_PKTRX1_NXTBUFCFG) Max Count Position */
#define SPW_PKTRX1_NXTBUFCFG_MAXCNT_Msk       (_U_(0xFFFF) << SPW_PKTRX1_NXTBUFCFG_MAXCNT_Pos)     /**< (SPW_PKTRX1_NXTBUFCFG) Max Count Mask */
#define SPW_PKTRX1_NXTBUFCFG_MAXCNT(value)    (SPW_PKTRX1_NXTBUFCFG_MAXCNT_Msk & ((value) << SPW_PKTRX1_NXTBUFCFG_MAXCNT_Pos))
#define SPW_PKTRX1_NXTBUFCFG_VALUE_Pos        _U_(16)                                              /**< (SPW_PKTRX1_NXTBUFCFG) Start Value Position */
#define SPW_PKTRX1_NXTBUFCFG_VALUE_Msk        (_U_(0x3F) << SPW_PKTRX1_NXTBUFCFG_VALUE_Pos)        /**< (SPW_PKTRX1_NXTBUFCFG) Start Value Mask */
#define SPW_PKTRX1_NXTBUFCFG_VALUE(value)     (SPW_PKTRX1_NXTBUFCFG_VALUE_Msk & ((value) << SPW_PKTRX1_NXTBUFCFG_VALUE_Pos))
#define SPW_PKTRX1_NXTBUFCFG_START_Pos        _U_(22)                                              /**< (SPW_PKTRX1_NXTBUFCFG) Start Mode Position */
#define SPW_PKTRX1_NXTBUFCFG_START_Msk        (_U_(0x7) << SPW_PKTRX1_NXTBUFCFG_START_Pos)         /**< (SPW_PKTRX1_NXTBUFCFG) Start Mode Mask */
#define SPW_PKTRX1_NXTBUFCFG_START(value)     (SPW_PKTRX1_NXTBUFCFG_START_Msk & ((value) << SPW_PKTRX1_NXTBUFCFG_START_Pos))
#define   SPW_PKTRX1_NXTBUFCFG_START_STARTEVENT_Val _U_(0x0)                                             /**< (SPW_PKTRX1_NXTBUFCFG) Start if any bit in Start Value matches an incoming event  */
#define   SPW_PKTRX1_NXTBUFCFG_START_STARTNOW_Val _U_(0x1)                                             /**< (SPW_PKTRX1_NXTBUFCFG) Start immediately. Request a deactivation on next packet boundary.  */
#define   SPW_PKTRX1_NXTBUFCFG_START_STARTTCH1_Val _U_(0x2)                                             /**< (SPW_PKTRX1_NXTBUFCFG) Start if Start Value matches an incoming Time Code from Time Code Handler 1  */
#define   SPW_PKTRX1_NXTBUFCFG_START_STARTLATER_Val _U_(0x4)                                             /**< (SPW_PKTRX1_NXTBUFCFG) Start when current buffer is deactivated (e.g., by buffer becoming full)  */
#define SPW_PKTRX1_NXTBUFCFG_START_STARTEVENT (SPW_PKTRX1_NXTBUFCFG_START_STARTEVENT_Val << SPW_PKTRX1_NXTBUFCFG_START_Pos) /**< (SPW_PKTRX1_NXTBUFCFG) Start if any bit in Start Value matches an incoming event Position  */
#define SPW_PKTRX1_NXTBUFCFG_START_STARTNOW   (SPW_PKTRX1_NXTBUFCFG_START_STARTNOW_Val << SPW_PKTRX1_NXTBUFCFG_START_Pos) /**< (SPW_PKTRX1_NXTBUFCFG) Start immediately. Request a deactivation on next packet boundary. Position  */
#define SPW_PKTRX1_NXTBUFCFG_START_STARTTCH1  (SPW_PKTRX1_NXTBUFCFG_START_STARTTCH1_Val << SPW_PKTRX1_NXTBUFCFG_START_Pos) /**< (SPW_PKTRX1_NXTBUFCFG) Start if Start Value matches an incoming Time Code from Time Code Handler 1 Position  */
#define SPW_PKTRX1_NXTBUFCFG_START_STARTLATER (SPW_PKTRX1_NXTBUFCFG_START_STARTLATER_Val << SPW_PKTRX1_NXTBUFCFG_START_Pos) /**< (SPW_PKTRX1_NXTBUFCFG) Start when current buffer is deactivated (e.g., by buffer becoming full) Position  */
#define SPW_PKTRX1_NXTBUFCFG_SPLIT_Pos        _U_(30)                                              /**< (SPW_PKTRX1_NXTBUFCFG) Split Pkt Position */
#define SPW_PKTRX1_NXTBUFCFG_SPLIT_Msk        (_U_(0x1) << SPW_PKTRX1_NXTBUFCFG_SPLIT_Pos)         /**< (SPW_PKTRX1_NXTBUFCFG) Split Pkt Mask */
#define SPW_PKTRX1_NXTBUFCFG_SPLIT(value)     (SPW_PKTRX1_NXTBUFCFG_SPLIT_Msk & ((value) << SPW_PKTRX1_NXTBUFCFG_SPLIT_Pos))
#define SPW_PKTRX1_NXTBUFCFG_Msk              _U_(0x41FFFFFF)                                      /**< (SPW_PKTRX1_NXTBUFCFG) Register Mask  */


/* -------- SPW_PKTRX1_CURBUFDATAADDR : (SPW Offset: 0x840) ( R/ 32) PktRx Current Buffer Data Address -------- */
#define SPW_PKTRX1_CURBUFDATAADDR_ADDR_Pos    _U_(0)                                               /**< (SPW_PKTRX1_CURBUFDATAADDR) Address Position */
#define SPW_PKTRX1_CURBUFDATAADDR_ADDR_Msk    (_U_(0xFFFFFFFF) << SPW_PKTRX1_CURBUFDATAADDR_ADDR_Pos) /**< (SPW_PKTRX1_CURBUFDATAADDR) Address Mask */
#define SPW_PKTRX1_CURBUFDATAADDR_ADDR(value) (SPW_PKTRX1_CURBUFDATAADDR_ADDR_Msk & ((value) << SPW_PKTRX1_CURBUFDATAADDR_ADDR_Pos))
#define SPW_PKTRX1_CURBUFDATAADDR_Msk         _U_(0xFFFFFFFF)                                      /**< (SPW_PKTRX1_CURBUFDATAADDR) Register Mask  */


/* -------- SPW_PKTRX1_CURBUFDATALEN : (SPW Offset: 0x844) ( R/ 32) PktRx Current Buffer Data Length -------- */
#define SPW_PKTRX1_CURBUFDATALEN_LEN_Pos      _U_(0)                                               /**< (SPW_PKTRX1_CURBUFDATALEN) Length Position */
#define SPW_PKTRX1_CURBUFDATALEN_LEN_Msk      (_U_(0xFFFFFF) << SPW_PKTRX1_CURBUFDATALEN_LEN_Pos)  /**< (SPW_PKTRX1_CURBUFDATALEN) Length Mask */
#define SPW_PKTRX1_CURBUFDATALEN_LEN(value)   (SPW_PKTRX1_CURBUFDATALEN_LEN_Msk & ((value) << SPW_PKTRX1_CURBUFDATALEN_LEN_Pos))
#define SPW_PKTRX1_CURBUFDATALEN_Msk          _U_(0x00FFFFFF)                                      /**< (SPW_PKTRX1_CURBUFDATALEN) Register Mask  */


/* -------- SPW_PKTRX1_CURBUFPKTADDR : (SPW Offset: 0x848) ( R/ 32) PktRx Current Buffer Packet Address -------- */
#define SPW_PKTRX1_CURBUFPKTADDR_ADDR_Pos     _U_(0)                                               /**< (SPW_PKTRX1_CURBUFPKTADDR) Address Position */
#define SPW_PKTRX1_CURBUFPKTADDR_ADDR_Msk     (_U_(0xFFFFFFFF) << SPW_PKTRX1_CURBUFPKTADDR_ADDR_Pos) /**< (SPW_PKTRX1_CURBUFPKTADDR) Address Mask */
#define SPW_PKTRX1_CURBUFPKTADDR_ADDR(value)  (SPW_PKTRX1_CURBUFPKTADDR_ADDR_Msk & ((value) << SPW_PKTRX1_CURBUFPKTADDR_ADDR_Pos))
#define SPW_PKTRX1_CURBUFPKTADDR_Msk          _U_(0xFFFFFFFF)                                      /**< (SPW_PKTRX1_CURBUFPKTADDR) Register Mask  */


/* -------- SPW_PKTRX1_CURBUFCFG : (SPW Offset: 0x84C) (R/W 32) PktRx Current Buffer Config -------- */
#define SPW_PKTRX1_CURBUFCFG_MAXCNT_Pos       _U_(0)                                               /**< (SPW_PKTRX1_CURBUFCFG) Max Count Position */
#define SPW_PKTRX1_CURBUFCFG_MAXCNT_Msk       (_U_(0xFFFF) << SPW_PKTRX1_CURBUFCFG_MAXCNT_Pos)     /**< (SPW_PKTRX1_CURBUFCFG) Max Count Mask */
#define SPW_PKTRX1_CURBUFCFG_MAXCNT(value)    (SPW_PKTRX1_CURBUFCFG_MAXCNT_Msk & ((value) << SPW_PKTRX1_CURBUFCFG_MAXCNT_Pos))
#define SPW_PKTRX1_CURBUFCFG_SPLIT_Pos        _U_(30)                                              /**< (SPW_PKTRX1_CURBUFCFG) Split Position */
#define SPW_PKTRX1_CURBUFCFG_SPLIT_Msk        (_U_(0x1) << SPW_PKTRX1_CURBUFCFG_SPLIT_Pos)         /**< (SPW_PKTRX1_CURBUFCFG) Split Mask */
#define SPW_PKTRX1_CURBUFCFG_SPLIT(value)     (SPW_PKTRX1_CURBUFCFG_SPLIT_Msk & ((value) << SPW_PKTRX1_CURBUFCFG_SPLIT_Pos))
#define SPW_PKTRX1_CURBUFCFG_ABORT_Pos        _U_(31)                                              /**< (SPW_PKTRX1_CURBUFCFG) Abort Position */
#define SPW_PKTRX1_CURBUFCFG_ABORT_Msk        (_U_(0x1) << SPW_PKTRX1_CURBUFCFG_ABORT_Pos)         /**< (SPW_PKTRX1_CURBUFCFG) Abort Mask */
#define SPW_PKTRX1_CURBUFCFG_ABORT(value)     (SPW_PKTRX1_CURBUFCFG_ABORT_Msk & ((value) << SPW_PKTRX1_CURBUFCFG_ABORT_Pos))
#define SPW_PKTRX1_CURBUFCFG_Msk              _U_(0xC000FFFF)                                      /**< (SPW_PKTRX1_CURBUFCFG) Register Mask  */


/* -------- SPW_PKTRX1_PREVBUFDATALEN : (SPW Offset: 0x850) ( R/ 32) PktRx Previous Buffer Data Length -------- */
#define SPW_PKTRX1_PREVBUFDATALEN_LEN_Pos     _U_(0)                                               /**< (SPW_PKTRX1_PREVBUFDATALEN) Length Position */
#define SPW_PKTRX1_PREVBUFDATALEN_LEN_Msk     (_U_(0xFFFFFF) << SPW_PKTRX1_PREVBUFDATALEN_LEN_Pos) /**< (SPW_PKTRX1_PREVBUFDATALEN) Length Mask */
#define SPW_PKTRX1_PREVBUFDATALEN_LEN(value)  (SPW_PKTRX1_PREVBUFDATALEN_LEN_Msk & ((value) << SPW_PKTRX1_PREVBUFDATALEN_LEN_Pos))
#define SPW_PKTRX1_PREVBUFDATALEN_Msk         _U_(0x00FFFFFF)                                      /**< (SPW_PKTRX1_PREVBUFDATALEN) Register Mask  */


