Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/spw.h
/* -------- SPW_PKTTX1_PI_RCS : (SPW Offset: 0xC0C) (R/W 32) PktTx Pending Read, Clear and Enabled Interrupt -------- */
#define SPW_PKTTX1_PI_RCS_DEACT_Pos           _U_(0)                                               /**< (SPW_PKTTX1_PI_RCS) Deactivated Position */
#define SPW_PKTTX1_PI_RCS_DEACT_Msk           (_U_(0x1) << SPW_PKTTX1_PI_RCS_DEACT_Pos)            /**< (SPW_PKTTX1_PI_RCS) Deactivated Mask */
#define SPW_PKTTX1_PI_RCS_DEACT(value)        (SPW_PKTTX1_PI_RCS_DEACT_Msk & ((value) << SPW_PKTTX1_PI_RCS_DEACT_Pos))
#define SPW_PKTTX1_PI_RCS_ACT_Pos             _U_(1)                                               /**< (SPW_PKTTX1_PI_RCS) Activated Position */
#define SPW_PKTTX1_PI_RCS_ACT_Msk             (_U_(0x1) << SPW_PKTTX1_PI_RCS_ACT_Pos)              /**< (SPW_PKTTX1_PI_RCS) Activated Mask */
#define SPW_PKTTX1_PI_RCS_ACT(value)          (SPW_PKTTX1_PI_RCS_ACT_Msk & ((value) << SPW_PKTTX1_PI_RCS_ACT_Pos))
#define SPW_PKTTX1_PI_RCS_EOP_Pos             _U_(2)                                               /**< (SPW_PKTTX1_PI_RCS) EOP sent Position */
#define SPW_PKTTX1_PI_RCS_EOP_Msk             (_U_(0x1) << SPW_PKTTX1_PI_RCS_EOP_Pos)              /**< (SPW_PKTTX1_PI_RCS) EOP sent Mask */
#define SPW_PKTTX1_PI_RCS_EOP(value)          (SPW_PKTTX1_PI_RCS_EOP_Msk & ((value) << SPW_PKTTX1_PI_RCS_EOP_Pos))
#define SPW_PKTTX1_PI_RCS_EEP_Pos             _U_(3)                                               /**< (SPW_PKTTX1_PI_RCS) EEP sent Position */
#define SPW_PKTTX1_PI_RCS_EEP_Msk             (_U_(0x1) << SPW_PKTTX1_PI_RCS_EEP_Pos)              /**< (SPW_PKTTX1_PI_RCS) EEP sent Mask */
#define SPW_PKTTX1_PI_RCS_EEP(value)          (SPW_PKTTX1_PI_RCS_EEP_Msk & ((value) << SPW_PKTTX1_PI_RCS_EEP_Pos))
#define SPW_PKTTX1_PI_RCS_Msk                 _U_(0x0000000F)                                      /**< (SPW_PKTTX1_PI_RCS) Register Mask  */


/* -------- SPW_PKTTX1_IM : (SPW Offset: 0xC10) (R/W 32) PktTx Interrupt Mask -------- */
#define SPW_PKTTX1_IM_DEACT_Pos               _U_(0)                                               /**< (SPW_PKTTX1_IM) Deactivated Position */
#define SPW_PKTTX1_IM_DEACT_Msk               (_U_(0x1) << SPW_PKTTX1_IM_DEACT_Pos)                /**< (SPW_PKTTX1_IM) Deactivated Mask */
#define SPW_PKTTX1_IM_DEACT(value)            (SPW_PKTTX1_IM_DEACT_Msk & ((value) << SPW_PKTTX1_IM_DEACT_Pos))
#define SPW_PKTTX1_IM_ACT_Pos                 _U_(1)                                               /**< (SPW_PKTTX1_IM) Activated Position */
#define SPW_PKTTX1_IM_ACT_Msk                 (_U_(0x1) << SPW_PKTTX1_IM_ACT_Pos)                  /**< (SPW_PKTTX1_IM) Activated Mask */
#define SPW_PKTTX1_IM_ACT(value)              (SPW_PKTTX1_IM_ACT_Msk & ((value) << SPW_PKTTX1_IM_ACT_Pos))
#define SPW_PKTTX1_IM_EOP_Pos                 _U_(2)                                               /**< (SPW_PKTTX1_IM) EOP sent Position */
#define SPW_PKTTX1_IM_EOP_Msk                 (_U_(0x1) << SPW_PKTTX1_IM_EOP_Pos)                  /**< (SPW_PKTTX1_IM) EOP sent Mask */
#define SPW_PKTTX1_IM_EOP(value)              (SPW_PKTTX1_IM_EOP_Msk & ((value) << SPW_PKTTX1_IM_EOP_Pos))
#define SPW_PKTTX1_IM_EEP_Pos                 _U_(3)                                               /**< (SPW_PKTTX1_IM) EEP sent Position */
#define SPW_PKTTX1_IM_EEP_Msk                 (_U_(0x1) << SPW_PKTTX1_IM_EEP_Pos)                  /**< (SPW_PKTTX1_IM) EEP sent Mask */
#define SPW_PKTTX1_IM_EEP(value)              (SPW_PKTTX1_IM_EEP_Msk & ((value) << SPW_PKTTX1_IM_EEP_Pos))
#define SPW_PKTTX1_IM_Msk                     _U_(0x0000000F)                                      /**< (SPW_PKTTX1_IM) Register Mask  */


/* -------- SPW_PKTTX1_PI_C : (SPW Offset: 0xC14) ( /W 32) PktTx Clear Pending Interrupt -------- */
#define SPW_PKTTX1_PI_C_DEACT_Pos             _U_(0)                                               /**< (SPW_PKTTX1_PI_C) Deactivated Position */
#define SPW_PKTTX1_PI_C_DEACT_Msk             (_U_(0x1) << SPW_PKTTX1_PI_C_DEACT_Pos)              /**< (SPW_PKTTX1_PI_C) Deactivated Mask */
#define SPW_PKTTX1_PI_C_DEACT(value)          (SPW_PKTTX1_PI_C_DEACT_Msk & ((value) << SPW_PKTTX1_PI_C_DEACT_Pos))
#define SPW_PKTTX1_PI_C_ACT_Pos               _U_(1)                                               /**< (SPW_PKTTX1_PI_C) Activated Position */
#define SPW_PKTTX1_PI_C_ACT_Msk               (_U_(0x1) << SPW_PKTTX1_PI_C_ACT_Pos)                /**< (SPW_PKTTX1_PI_C) Activated Mask */
#define SPW_PKTTX1_PI_C_ACT(value)            (SPW_PKTTX1_PI_C_ACT_Msk & ((value) << SPW_PKTTX1_PI_C_ACT_Pos))
#define SPW_PKTTX1_PI_C_EOP_Pos               _U_(2)                                               /**< (SPW_PKTTX1_PI_C) EOP sent Position */
#define SPW_PKTTX1_PI_C_EOP_Msk               (_U_(0x1) << SPW_PKTTX1_PI_C_EOP_Pos)                /**< (SPW_PKTTX1_PI_C) EOP sent Mask */
#define SPW_PKTTX1_PI_C_EOP(value)            (SPW_PKTTX1_PI_C_EOP_Msk & ((value) << SPW_PKTTX1_PI_C_EOP_Pos))
#define SPW_PKTTX1_PI_C_EEP_Pos               _U_(3)                                               /**< (SPW_PKTTX1_PI_C) EEP sent Position */
#define SPW_PKTTX1_PI_C_EEP_Msk               (_U_(0x1) << SPW_PKTTX1_PI_C_EEP_Pos)                /**< (SPW_PKTTX1_PI_C) EEP sent Mask */
#define SPW_PKTTX1_PI_C_EEP(value)            (SPW_PKTTX1_PI_C_EEP_Msk & ((value) << SPW_PKTTX1_PI_C_EEP_Pos))
#define SPW_PKTTX1_PI_C_Msk                   _U_(0x0000000F)                                      /**< (SPW_PKTTX1_PI_C) Register Mask  */


/* -------- SPW_PKTTX1_IM_S : (SPW Offset: 0xC18) ( /W 32) PktTx Interrupt Set Mask -------- */
#define SPW_PKTTX1_IM_S_DEACT_Pos             _U_(0)                                               /**< (SPW_PKTTX1_IM_S) Deactivated Position */
#define SPW_PKTTX1_IM_S_DEACT_Msk             (_U_(0x1) << SPW_PKTTX1_IM_S_DEACT_Pos)              /**< (SPW_PKTTX1_IM_S) Deactivated Mask */
#define SPW_PKTTX1_IM_S_DEACT(value)          (SPW_PKTTX1_IM_S_DEACT_Msk & ((value) << SPW_PKTTX1_IM_S_DEACT_Pos))
#define SPW_PKTTX1_IM_S_ACT_Pos               _U_(1)                                               /**< (SPW_PKTTX1_IM_S) Activated Position */
#define SPW_PKTTX1_IM_S_ACT_Msk               (_U_(0x1) << SPW_PKTTX1_IM_S_ACT_Pos)                /**< (SPW_PKTTX1_IM_S) Activated Mask */
#define SPW_PKTTX1_IM_S_ACT(value)            (SPW_PKTTX1_IM_S_ACT_Msk & ((value) << SPW_PKTTX1_IM_S_ACT_Pos))
#define SPW_PKTTX1_IM_S_EOP_Pos               _U_(2)                                               /**< (SPW_PKTTX1_IM_S) EOP sent Position */
#define SPW_PKTTX1_IM_S_EOP_Msk               (_U_(0x1) << SPW_PKTTX1_IM_S_EOP_Pos)                /**< (SPW_PKTTX1_IM_S) EOP sent Mask */
#define SPW_PKTTX1_IM_S_EOP(value)            (SPW_PKTTX1_IM_S_EOP_Msk & ((value) << SPW_PKTTX1_IM_S_EOP_Pos))
#define SPW_PKTTX1_IM_S_EEP_Pos               _U_(3)                                               /**< (SPW_PKTTX1_IM_S) EEP sent Position */
#define SPW_PKTTX1_IM_S_EEP_Msk               (_U_(0x1) << SPW_PKTTX1_IM_S_EEP_Pos)                /**< (SPW_PKTTX1_IM_S) EEP sent Mask */
#define SPW_PKTTX1_IM_S_EEP(value)            (SPW_PKTTX1_IM_S_EEP_Msk & ((value) << SPW_PKTTX1_IM_S_EEP_Pos))
#define SPW_PKTTX1_IM_S_Msk                   _U_(0x0000000F)                                      /**< (SPW_PKTTX1_IM_S) Register Mask  */


/* -------- SPW_PKTTX1_IM_C : (SPW Offset: 0xC1C) ( /W 32) PktTx Interrupt Clear Mask -------- */
#define SPW_PKTTX1_IM_C_DEACT_Pos             _U_(0)                                               /**< (SPW_PKTTX1_IM_C) Deactivated Position */
#define SPW_PKTTX1_IM_C_DEACT_Msk             (_U_(0x1) << SPW_PKTTX1_IM_C_DEACT_Pos)              /**< (SPW_PKTTX1_IM_C) Deactivated Mask */
#define SPW_PKTTX1_IM_C_DEACT(value)          (SPW_PKTTX1_IM_C_DEACT_Msk & ((value) << SPW_PKTTX1_IM_C_DEACT_Pos))
#define SPW_PKTTX1_IM_C_ACT_Pos               _U_(1)                                               /**< (SPW_PKTTX1_IM_C) Activated Position */
#define SPW_PKTTX1_IM_C_ACT_Msk               (_U_(0x1) << SPW_PKTTX1_IM_C_ACT_Pos)                /**< (SPW_PKTTX1_IM_C) Activated Mask */
#define SPW_PKTTX1_IM_C_ACT(value)            (SPW_PKTTX1_IM_C_ACT_Msk & ((value) << SPW_PKTTX1_IM_C_ACT_Pos))
#define SPW_PKTTX1_IM_C_EOP_Pos               _U_(2)                                               /**< (SPW_PKTTX1_IM_C) EOP sent Position */
#define SPW_PKTTX1_IM_C_EOP_Msk               (_U_(0x1) << SPW_PKTTX1_IM_C_EOP_Pos)                /**< (SPW_PKTTX1_IM_C) EOP sent Mask */
#define SPW_PKTTX1_IM_C_EOP(value)            (SPW_PKTTX1_IM_C_EOP_Msk & ((value) << SPW_PKTTX1_IM_C_EOP_Pos))
#define SPW_PKTTX1_IM_C_EEP_Pos               _U_(3)                                               /**< (SPW_PKTTX1_IM_C) EEP sent Position */
#define SPW_PKTTX1_IM_C_EEP_Msk               (_U_(0x1) << SPW_PKTTX1_IM_C_EEP_Pos)                /**< (SPW_PKTTX1_IM_C) EEP sent Mask */
#define SPW_PKTTX1_IM_C_EEP(value)            (SPW_PKTTX1_IM_C_EEP_Msk & ((value) << SPW_PKTTX1_IM_C_EEP_Pos))
#define SPW_PKTTX1_IM_C_Msk                   _U_(0x0000000F)                                      /**< (SPW_PKTTX1_IM_C) Register Mask  */


/* -------- SPW_PKTTX1_STATUS : (SPW Offset: 0xC20) (R/W 32) PktTx Status -------- */
#define SPW_PKTTX1_STATUS_ARM_Pos             _U_(0)                                               /**< (SPW_PKTTX1_STATUS) Armed Position */
#define SPW_PKTTX1_STATUS_ARM_Msk             (_U_(0x1) << SPW_PKTTX1_STATUS_ARM_Pos)              /**< (SPW_PKTTX1_STATUS) Armed Mask */
#define SPW_PKTTX1_STATUS_ARM(value)          (SPW_PKTTX1_STATUS_ARM_Msk & ((value) << SPW_PKTTX1_STATUS_ARM_Pos))
#define SPW_PKTTX1_STATUS_ACT_Pos             _U_(1)                                               /**< (SPW_PKTTX1_STATUS) Active Position */
#define SPW_PKTTX1_STATUS_ACT_Msk             (_U_(0x1) << SPW_PKTTX1_STATUS_ACT_Pos)              /**< (SPW_PKTTX1_STATUS) Active Mask */
#define SPW_PKTTX1_STATUS_ACT(value)          (SPW_PKTTX1_STATUS_ACT_Msk & ((value) << SPW_PKTTX1_STATUS_ACT_Pos))
#define SPW_PKTTX1_STATUS_PENDING_Pos         _U_(2)                                               /**< (SPW_PKTTX1_STATUS) Pending Position */
#define SPW_PKTTX1_STATUS_PENDING_Msk         (_U_(0x1) << SPW_PKTTX1_STATUS_PENDING_Pos)          /**< (SPW_PKTTX1_STATUS) Pending Mask */
#define SPW_PKTTX1_STATUS_PENDING(value)      (SPW_PKTTX1_STATUS_PENDING_Msk & ((value) << SPW_PKTTX1_STATUS_PENDING_Pos))
#define SPW_PKTTX1_STATUS_DEACT_Pos           _U_(3)                                               /**< (SPW_PKTTX1_STATUS) Deactivating Position */
#define SPW_PKTTX1_STATUS_DEACT_Msk           (_U_(0x1) << SPW_PKTTX1_STATUS_DEACT_Pos)            /**< (SPW_PKTTX1_STATUS) Deactivating Mask */
#define SPW_PKTTX1_STATUS_DEACT(value)        (SPW_PKTTX1_STATUS_DEACT_Msk & ((value) << SPW_PKTTX1_STATUS_DEACT_Pos))
#define SPW_PKTTX1_STATUS_PREV_Pos            _U_(16)                                              /**< (SPW_PKTTX1_STATUS) Previous Position */
#define SPW_PKTTX1_STATUS_PREV_Msk            (_U_(0x7) << SPW_PKTTX1_STATUS_PREV_Pos)             /**< (SPW_PKTTX1_STATUS) Previous Mask */
#define SPW_PKTTX1_STATUS_PREV(value)         (SPW_PKTTX1_STATUS_PREV_Msk & ((value) << SPW_PKTTX1_STATUS_PREV_Pos))
#define   SPW_PKTTX1_STATUS_PREV_NOINFO_Val   _U_(0x0)                                             /**< (SPW_PKTTX1_STATUS) No information. Field not locked.  */
#define   SPW_PKTTX1_STATUS_PREV_LASTSENDLISTOK_Val _U_(0x1)                                             /**< (SPW_PKTTX1_STATUS) Last send list fully done  */
#define   SPW_PKTTX1_STATUS_PREV_ABORTEDMEMERR_Val _U_(0x2)                                             /**< (SPW_PKTTX1_STATUS) Aborted due to memory access error.  */
#define   SPW_PKTTX1_STATUS_PREV_ABORTEDNEWSD_Val _U_(0x3)                                             /**< (SPW_PKTTX1_STATUS) Aborted by new send list.  */
#define   SPW_PKTTX1_STATUS_PREV_ABORTEDUSERCMD_Val _U_(0x4)                                             /**< (SPW_PKTTX1_STATUS) Aborted by direct user command.  */
#define   SPW_PKTTX1_STATUS_PREV_ABORTEDTIMEOUT_Val _U_(0x5)                                             /**< (SPW_PKTTX1_STATUS) Aborted by timeout.  */
#define SPW_PKTTX1_STATUS_PREV_NOINFO         (SPW_PKTTX1_STATUS_PREV_NOINFO_Val << SPW_PKTTX1_STATUS_PREV_Pos) /**< (SPW_PKTTX1_STATUS) No information. Field not locked. Position  */
#define SPW_PKTTX1_STATUS_PREV_LASTSENDLISTOK (SPW_PKTTX1_STATUS_PREV_LASTSENDLISTOK_Val << SPW_PKTTX1_STATUS_PREV_Pos) /**< (SPW_PKTTX1_STATUS) Last send list fully done Position  */
#define SPW_PKTTX1_STATUS_PREV_ABORTEDMEMERR  (SPW_PKTTX1_STATUS_PREV_ABORTEDMEMERR_Val << SPW_PKTTX1_STATUS_PREV_Pos) /**< (SPW_PKTTX1_STATUS) Aborted due to memory access error. Position  */
#define SPW_PKTTX1_STATUS_PREV_ABORTEDNEWSD   (SPW_PKTTX1_STATUS_PREV_ABORTEDNEWSD_Val << SPW_PKTTX1_STATUS_PREV_Pos) /**< (SPW_PKTTX1_STATUS) Aborted by new send list. Position  */
#define SPW_PKTTX1_STATUS_PREV_ABORTEDUSERCMD (SPW_PKTTX1_STATUS_PREV_ABORTEDUSERCMD_Val << SPW_PKTTX1_STATUS_PREV_Pos) /**< (SPW_PKTTX1_STATUS) Aborted by direct user command. Position  */
#define SPW_PKTTX1_STATUS_PREV_ABORTEDTIMEOUT (SPW_PKTTX1_STATUS_PREV_ABORTEDTIMEOUT_Val << SPW_PKTTX1_STATUS_PREV_Pos) /**< (SPW_PKTTX1_STATUS) Aborted by timeout. Position  */
#define SPW_PKTTX1_STATUS_Msk                 _U_(0x0007000F)                                      /**< (SPW_PKTTX1_STATUS) Register Mask  */


/* -------- SPW_PKTTX1_NXTSENDROUT : (SPW Offset: 0xC24) (R/W 32) PktTx Next Send List Router Bytes -------- */
#define SPW_PKTTX1_NXTSENDROUT_BYTE4_Pos      _U_(0)                                               /**< (SPW_PKTTX1_NXTSENDROUT) Byte4 Position */
#define SPW_PKTTX1_NXTSENDROUT_BYTE4_Msk      (_U_(0xFF) << SPW_PKTTX1_NXTSENDROUT_BYTE4_Pos)      /**< (SPW_PKTTX1_NXTSENDROUT) Byte4 Mask */
#define SPW_PKTTX1_NXTSENDROUT_BYTE4(value)   (SPW_PKTTX1_NXTSENDROUT_BYTE4_Msk & ((value) << SPW_PKTTX1_NXTSENDROUT_BYTE4_Pos))
#define SPW_PKTTX1_NXTSENDROUT_BYTE3_Pos      _U_(8)                                               /**< (SPW_PKTTX1_NXTSENDROUT) Byte3 Position */
#define SPW_PKTTX1_NXTSENDROUT_BYTE3_Msk      (_U_(0xFF) << SPW_PKTTX1_NXTSENDROUT_BYTE3_Pos)      /**< (SPW_PKTTX1_NXTSENDROUT) Byte3 Mask */
#define SPW_PKTTX1_NXTSENDROUT_BYTE3(value)   (SPW_PKTTX1_NXTSENDROUT_BYTE3_Msk & ((value) << SPW_PKTTX1_NXTSENDROUT_BYTE3_Pos))
#define SPW_PKTTX1_NXTSENDROUT_BYTE2_Pos      _U_(16)                                              /**< (SPW_PKTTX1_NXTSENDROUT) Byte2 Position */
#define SPW_PKTTX1_NXTSENDROUT_BYTE2_Msk      (_U_(0xFF) << SPW_PKTTX1_NXTSENDROUT_BYTE2_Pos)      /**< (SPW_PKTTX1_NXTSENDROUT) Byte2 Mask */
#define SPW_PKTTX1_NXTSENDROUT_BYTE2(value)   (SPW_PKTTX1_NXTSENDROUT_BYTE2_Msk & ((value) << SPW_PKTTX1_NXTSENDROUT_BYTE2_Pos))
#define SPW_PKTTX1_NXTSENDROUT_BYTE1_Pos      _U_(24)                                              /**< (SPW_PKTTX1_NXTSENDROUT) Byte1 Position */
#define SPW_PKTTX1_NXTSENDROUT_BYTE1_Msk      (_U_(0xFF) << SPW_PKTTX1_NXTSENDROUT_BYTE1_Pos)      /**< (SPW_PKTTX1_NXTSENDROUT) Byte1 Mask */
#define SPW_PKTTX1_NXTSENDROUT_BYTE1(value)   (SPW_PKTTX1_NXTSENDROUT_BYTE1_Msk & ((value) << SPW_PKTTX1_NXTSENDROUT_BYTE1_Pos))
#define SPW_PKTTX1_NXTSENDROUT_Msk            _U_(0xFFFFFFFF)                                      /**< (SPW_PKTTX1_NXTSENDROUT) Register Mask  */


