Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/spw.h
/* -------- SPW_PKTTX1_NXTSENDADDR : (SPW Offset: 0xC28) (R/W 32) PktTx Next Send List Address -------- */
#define SPW_PKTTX1_NXTSENDADDR_ADDR_Pos       _U_(0)                                               /**< (SPW_PKTTX1_NXTSENDADDR) Address Position */
#define SPW_PKTTX1_NXTSENDADDR_ADDR_Msk       (_U_(0xFFFFFFFF) << SPW_PKTTX1_NXTSENDADDR_ADDR_Pos) /**< (SPW_PKTTX1_NXTSENDADDR) Address Mask */
#define SPW_PKTTX1_NXTSENDADDR_ADDR(value)    (SPW_PKTTX1_NXTSENDADDR_ADDR_Msk & ((value) << SPW_PKTTX1_NXTSENDADDR_ADDR_Pos))
#define SPW_PKTTX1_NXTSENDADDR_Msk            _U_(0xFFFFFFFF)                                      /**< (SPW_PKTTX1_NXTSENDADDR) Register Mask  */


/* -------- SPW_PKTTX1_NXTSENDCFG : (SPW Offset: 0xC2C) (R/W 32) PktTx Next Send List Config -------- */
#define SPW_PKTTX1_NXTSENDCFG_LEN_Pos         _U_(0)                                               /**< (SPW_PKTTX1_NXTSENDCFG) Length Position */
#define SPW_PKTTX1_NXTSENDCFG_LEN_Msk         (_U_(0xFFFF) << SPW_PKTTX1_NXTSENDCFG_LEN_Pos)       /**< (SPW_PKTTX1_NXTSENDCFG) Length Mask */
#define SPW_PKTTX1_NXTSENDCFG_LEN(value)      (SPW_PKTTX1_NXTSENDCFG_LEN_Msk & ((value) << SPW_PKTTX1_NXTSENDCFG_LEN_Pos))
#define SPW_PKTTX1_NXTSENDCFG_VALUE_Pos       _U_(16)                                              /**< (SPW_PKTTX1_NXTSENDCFG) Start Value Position */
#define SPW_PKTTX1_NXTSENDCFG_VALUE_Msk       (_U_(0x3F) << SPW_PKTTX1_NXTSENDCFG_VALUE_Pos)       /**< (SPW_PKTTX1_NXTSENDCFG) Start Value Mask */
#define SPW_PKTTX1_NXTSENDCFG_VALUE(value)    (SPW_PKTTX1_NXTSENDCFG_VALUE_Msk & ((value) << SPW_PKTTX1_NXTSENDCFG_VALUE_Pos))
#define SPW_PKTTX1_NXTSENDCFG_START_Pos       _U_(22)                                              /**< (SPW_PKTTX1_NXTSENDCFG) Start Mode Position */
#define SPW_PKTTX1_NXTSENDCFG_START_Msk       (_U_(0x3) << SPW_PKTTX1_NXTSENDCFG_START_Pos)        /**< (SPW_PKTTX1_NXTSENDCFG) Start Mode Mask */
#define SPW_PKTTX1_NXTSENDCFG_START(value)    (SPW_PKTTX1_NXTSENDCFG_START_Msk & ((value) << SPW_PKTTX1_NXTSENDCFG_START_Pos))
#define   SPW_PKTTX1_NXTSENDCFG_START_STARTEVENT_Val _U_(0x0)                                             /**< (SPW_PKTTX1_NXTSENDCFG) Start if any bit in Start Value matches an incoming event  */
#define   SPW_PKTTX1_NXTSENDCFG_START_STARTNOW_Val _U_(0x1)                                             /**< (SPW_PKTTX1_NXTSENDCFG) Start immediately, if possible  */
#define   SPW_PKTTX1_NXTSENDCFG_START_STARTTCH1_Val _U_(0x2)                                             /**< (SPW_PKTTX1_NXTSENDCFG) Start if Start Value matches an incoming Time Code from Time Code Handler 1  */
#define SPW_PKTTX1_NXTSENDCFG_START_STARTEVENT (SPW_PKTTX1_NXTSENDCFG_START_STARTEVENT_Val << SPW_PKTTX1_NXTSENDCFG_START_Pos) /**< (SPW_PKTTX1_NXTSENDCFG) Start if any bit in Start Value matches an incoming event Position  */
#define SPW_PKTTX1_NXTSENDCFG_START_STARTNOW  (SPW_PKTTX1_NXTSENDCFG_START_STARTNOW_Val << SPW_PKTTX1_NXTSENDCFG_START_Pos) /**< (SPW_PKTTX1_NXTSENDCFG) Start immediately, if possible Position  */
#define SPW_PKTTX1_NXTSENDCFG_START_STARTTCH1 (SPW_PKTTX1_NXTSENDCFG_START_STARTTCH1_Val << SPW_PKTTX1_NXTSENDCFG_START_Pos) /**< (SPW_PKTTX1_NXTSENDCFG) Start if Start Value matches an incoming Time Code from Time Code Handler 1 Position  */
#define SPW_PKTTX1_NXTSENDCFG_ABORT_Pos       _U_(29)                                              /**< (SPW_PKTTX1_NXTSENDCFG) Abort Position */
#define SPW_PKTTX1_NXTSENDCFG_ABORT_Msk       (_U_(0x1) << SPW_PKTTX1_NXTSENDCFG_ABORT_Pos)        /**< (SPW_PKTTX1_NXTSENDCFG) Abort Mask */
#define SPW_PKTTX1_NXTSENDCFG_ABORT(value)    (SPW_PKTTX1_NXTSENDCFG_ABORT_Msk & ((value) << SPW_PKTTX1_NXTSENDCFG_ABORT_Pos))
#define SPW_PKTTX1_NXTSENDCFG_Msk             _U_(0x20FFFFFF)                                      /**< (SPW_PKTTX1_NXTSENDCFG) Register Mask  */


/* -------- SPW_PKTTX1_CURSENDROUT : (SPW Offset: 0xC30) ( R/ 32) PktTx Current Send List Router Bytes -------- */
#define SPW_PKTTX1_CURSENDROUT_BYTE4_Pos      _U_(0)                                               /**< (SPW_PKTTX1_CURSENDROUT) Byte4 Position */
#define SPW_PKTTX1_CURSENDROUT_BYTE4_Msk      (_U_(0xFF) << SPW_PKTTX1_CURSENDROUT_BYTE4_Pos)      /**< (SPW_PKTTX1_CURSENDROUT) Byte4 Mask */
#define SPW_PKTTX1_CURSENDROUT_BYTE4(value)   (SPW_PKTTX1_CURSENDROUT_BYTE4_Msk & ((value) << SPW_PKTTX1_CURSENDROUT_BYTE4_Pos))
#define SPW_PKTTX1_CURSENDROUT_BYTE3_Pos      _U_(8)                                               /**< (SPW_PKTTX1_CURSENDROUT) Byte3 Position */
#define SPW_PKTTX1_CURSENDROUT_BYTE3_Msk      (_U_(0xFF) << SPW_PKTTX1_CURSENDROUT_BYTE3_Pos)      /**< (SPW_PKTTX1_CURSENDROUT) Byte3 Mask */
#define SPW_PKTTX1_CURSENDROUT_BYTE3(value)   (SPW_PKTTX1_CURSENDROUT_BYTE3_Msk & ((value) << SPW_PKTTX1_CURSENDROUT_BYTE3_Pos))
#define SPW_PKTTX1_CURSENDROUT_BYTE2_Pos      _U_(16)                                              /**< (SPW_PKTTX1_CURSENDROUT) Byte2 Position */
#define SPW_PKTTX1_CURSENDROUT_BYTE2_Msk      (_U_(0xFF) << SPW_PKTTX1_CURSENDROUT_BYTE2_Pos)      /**< (SPW_PKTTX1_CURSENDROUT) Byte2 Mask */
#define SPW_PKTTX1_CURSENDROUT_BYTE2(value)   (SPW_PKTTX1_CURSENDROUT_BYTE2_Msk & ((value) << SPW_PKTTX1_CURSENDROUT_BYTE2_Pos))
#define SPW_PKTTX1_CURSENDROUT_BYTE1_Pos      _U_(24)                                              /**< (SPW_PKTTX1_CURSENDROUT) Byte1 Position */
#define SPW_PKTTX1_CURSENDROUT_BYTE1_Msk      (_U_(0xFF) << SPW_PKTTX1_CURSENDROUT_BYTE1_Pos)      /**< (SPW_PKTTX1_CURSENDROUT) Byte1 Mask */
#define SPW_PKTTX1_CURSENDROUT_BYTE1(value)   (SPW_PKTTX1_CURSENDROUT_BYTE1_Msk & ((value) << SPW_PKTTX1_CURSENDROUT_BYTE1_Pos))
#define SPW_PKTTX1_CURSENDROUT_Msk            _U_(0xFFFFFFFF)                                      /**< (SPW_PKTTX1_CURSENDROUT) Register Mask  */


/* -------- SPW_PKTTX1_CURSENDADDR : (SPW Offset: 0xC34) ( R/ 32) PktTx Current Send List Address -------- */
#define SPW_PKTTX1_CURSENDADDR_ADDR_Pos       _U_(0)                                               /**< (SPW_PKTTX1_CURSENDADDR) Address Position */
#define SPW_PKTTX1_CURSENDADDR_ADDR_Msk       (_U_(0xFFFFFFFF) << SPW_PKTTX1_CURSENDADDR_ADDR_Pos) /**< (SPW_PKTTX1_CURSENDADDR) Address Mask */
#define SPW_PKTTX1_CURSENDADDR_ADDR(value)    (SPW_PKTTX1_CURSENDADDR_ADDR_Msk & ((value) << SPW_PKTTX1_CURSENDADDR_ADDR_Pos))
#define SPW_PKTTX1_CURSENDADDR_Msk            _U_(0xFFFFFFFF)                                      /**< (SPW_PKTTX1_CURSENDADDR) Register Mask  */


/* -------- SPW_PKTTX1_CURSENDCFG : (SPW Offset: 0xC38) (R/W 32) PktTx Current Send List Config -------- */
#define SPW_PKTTX1_CURSENDCFG_LEN_Pos         _U_(0)                                               /**< (SPW_PKTTX1_CURSENDCFG) Length Position */
#define SPW_PKTTX1_CURSENDCFG_LEN_Msk         (_U_(0xFFFF) << SPW_PKTTX1_CURSENDCFG_LEN_Pos)       /**< (SPW_PKTTX1_CURSENDCFG) Length Mask */
#define SPW_PKTTX1_CURSENDCFG_LEN(value)      (SPW_PKTTX1_CURSENDCFG_LEN_Msk & ((value) << SPW_PKTTX1_CURSENDCFG_LEN_Pos))
#define SPW_PKTTX1_CURSENDCFG_ABORT_Pos       _U_(31)                                              /**< (SPW_PKTTX1_CURSENDCFG) Abort Position */
#define SPW_PKTTX1_CURSENDCFG_ABORT_Msk       (_U_(0x1) << SPW_PKTTX1_CURSENDCFG_ABORT_Pos)        /**< (SPW_PKTTX1_CURSENDCFG) Abort Mask */
#define SPW_PKTTX1_CURSENDCFG_ABORT(value)    (SPW_PKTTX1_CURSENDCFG_ABORT_Msk & ((value) << SPW_PKTTX1_CURSENDCFG_ABORT_Pos))
#define SPW_PKTTX1_CURSENDCFG_Msk             _U_(0x8000FFFF)                                      /**< (SPW_PKTTX1_CURSENDCFG) Register Mask  */


